openCSMP/openCSMP/lib/samg/samg1.h
//****************************************************************************************
// file: samg.h
// automatically created by tool make_amgparms_user
// created on (yyyy-mm-dd): 2014-11-20, time: 13:48
//****************************************************************************************

// INTERFACE TO FORTRAN90 SAMG1 : amg subroutines have
// to be called as SAMG1_SAMG when this interface is used
// author: Tanja Clees
// last modified: 2011/10/11 AK

////////////
/* Macros */
////////////

/* subroutine naming conventions.
for Unix / Linux: depending on the names of the Fortran symbols in libamg.a,
   choose one of the following macros via a -D option for the C++ compiler
   in your make.inc (as has already been done in the include files provided!):
      SAMG_LCASE
      SAMG_LCASE_USCORE   (see below what they do)
   if none of the above matches the naming conventions for your system,
   define appropriate macros yourself!
*/

/* SAMG_C_CALLCONV: macro (for Windows!) defining the standard calling convention.
   for Unix / Linux: set -DSAMG_UNIX_LINUX as an option for the C++ compiler
   in your make.inc (as has already been done in the include files provided!) */

/* Applications uses 8 Byte integers */
#ifdef INTEGER_SIZE_64
#ifdef _WIN32
#define APPL_INT __int64
#else
#define APPL_INT long int
#endif
#endif

/* default 4 Byte integer types */
#ifndef APPL_INT
#define APPL_INT int
#endif

#if SAMG_UNIX_LINUX
#define SAMG_C_CALLCONV void
#elif SAMG_CVF
// for Compaq Visual Fortran (tested with 6.6 X) :
#define SAMG_C_CALLCONV void __stdcall
#else
// for Intel Visual Fortran (tested with 8.X) :
#define SAMG_C_CALLCONV void __cdecl
#endif


/////////////////////////////////////
/* directives for subroutine names */
/////////////////////////////////////

#ifdef SAMG_LCASE
#define SAMG1 samg1
#define SAMG1_CTIME samg1_ctime
#define SAMG1_CPUTIME samg1_cputime
#define SAMG1_ELAPSED_TIME samg1_elapsed_time
#define SAMG1_ALL_ERRORINFO samg1_all_errorinfo
#define SAMG1_SIMPLE samg1_simple
#define SAMG1_MAIN samg1_main
#define SAMG1_LEAVE samg1_leave
#define SAMG1_REFRESH samg1_refresh
#define SAMG1_CLEANUP samg1_cleanup
#define SAMG1_RESET_HIDDEN samg1_reset_hidden
#define SAMG1_GET_COMPLEXITIES samg1_get_complexities
#define SAMG1_GET_NFLAG samg1_get_nflag
#define SAMG1_SET_NFLAG samg1_set_nflag
#define SAMG1_GET_NFLAGO samg1_get_nflago
#define SAMG1_SET_NFLAGO samg1_set_nflago
#define SAMG1_GET_NFLAGP samg1_get_nflagp
#define SAMG1_SET_NFLAGP samg1_set_nflagp
#define SAMG1_GET_NFLAGS samg1_get_nflags
#define SAMG1_SET_NFLAGS samg1_set_nflags
#define SAMG1_GET_LEVELS_CREATED samg1_get_levels_created
#define SAMG1_GET_LEVELS_USED samg1_get_levels_used
#define SAMG1_GET_LEV_SIZES samg1_get_lev_sizes
#define SAMG1_GET_MEM_ACTIVE samg1_get_mem_active
#define SAMG1_GET_TIME_AND_MEM samg1_get_time_and_mem
#define SAMG1_EXTRAPRINT samg1_extraprint
#define SAMG1_FLUSH samg1_flush
#define SAMG1_CVEC_ALLOC samg1_cvec_alloc
#define SAMG1_CVEC_DEALLOC samg1_cvec_dealloc
#define SAMG1_CVEC_SET samg1_cvec_set
#define SAMG1_CVEC_GET samg1_cvec_get
#define SAMG1_PROPOSE_NSYS_ISCALE_IU samg1_propose_nsys_iscale_iu
#define SAMG1_USED_OMP_THREADS samg1_used_omp_threads
#define SAMG1_GET_INNERMAX samg1_get_innermax
#define SAMG1_SET_INNERMAX samg1_set_innermax
#define SAMG1_DRV_SET_INNERMAX samg1_drv1_set_innermax
#define SAMG1_GET_NUM_SMOOTH_VECTORS samg1_get_num_smooth_vectors
#define SAMG1_SMOOTH_VECTOR_INIT samg1_smooth_vector_init
#define SAMG1_SMOOTH_VECTOR_SET samg1_smooth_vector_set
#define SAMG1_SMOOTH_VECTOR_GET samg1_smooth_vector_get
#define SAMG1_GET_NUM_DEFLATION_VECTORS samg1_get_num_deflation_vectors
#define SAMG1_DEFLATION_VECTOR_INIT samg1_deflation_vector_init
#define SAMG1_DEFLATION_VECTOR_SET samg1_deflation_vector_set
#define SAMG1_DEFLATION_VECTOR_GET samg1_deflation_vector_get
#define SAMG1_USER_CHECK samg1_user_check
#define SAMG1_USER_SOLVE samg1_user_solve
#define SAMG1_USER_CLEANUP samg1_user_cleanup
#define SAMG1_ARRAY_OFFSET samg1_array_offset
#define SAMG1_PERFINIT samg1_perfinit
#define SAMG1_PERFOUT samg1_perfout
#define SAMG1_PARALLEL_LIB samg1_parallel_lib
#define SAMG1_MEM_INFO samg1_mem_info
#define SAMG1_LRATIO samg1_lratio
#define SAMG1_ADDTIME samg1_addtime
#define SAMG1_COMPTIME samg1_comptime
#define SAMG1_COPY_GALERKIN samg1_copy_galerkin
#define SAMG1_OMEGA_JACOBI_ALLOC samg1_omega_jacobi_alloc
#define SAMG1_OMEGA_JACOBI_DEALLOC samg1_omega_jacobi_dealloc
#define SAMG1_OMEGA_JACOBI_SET samg1_omega_jacobi_set
#define SAMG1_CURRENT_RESIDUAL samg1_current_residual
#define SAMG1_OPEN_LOGFILE samg1_open_logfile
#define SAMG1_CLOSE_LOGFILE samg1_close_logfile
#define SAMG1_COO_VEC_SET samg1_coo_vec_set
#define SAMG1_COO_VEC_ALLOC samg1_coo_vec_alloc
#define SAMG1_COO_VEC_DEALLOC samg1_coo_vec_dealloc
#define SAMG1_IDEC samg1_idec
#define SAMG1_DC samg1_dc
#define XSAMG1 xsamg1
#define XSAMG1_DC xsamg1_dc
#define XSAMG1_START xsamg1_start
#define XSAMG1_START_LINUX xsamg1_start_linux
#define XSAMG1_USER_CTRL xsamg1_user_ctrl
#define XSAMG1_START_IUM xsamg1_start_ium
#define XSAMG1_START_SOLVER xsamg1_start_solver
#define XSAMG1_END_SOLVER xsamg1_end_solver
#define XSAMG1_FINALIZE xsamg1_finalize
#define XSAMG1_END xsamg1_end
#define XSAMG1_GET_LOGIO xsamg1_get_logio
#define XSAMG1_GET_SLAVE_RETURNCODE xsamg1_get_slave_returncode
#define XSAMG1_PROCESS_INFO xsamg1_process_info
#define XSAMG1_GET_INTERNAL_TIMER xsamg1_get_internal_timer
#define XSAMG1_MPI_INIT xsamg1_mpi_init
#define XSAMG1_MPI_FINALIZE xsamg1_mpi_finalize
#define XSAMG1_MPI_COMM_RANK xsamg1_mpi_comm_rank
#define XSAMG1_GET_MPI_COMM_WORLD xsamg1_get_mpi_comm_world
#define XSAMG1_GET_PARALLEL_RUN xsamg1_get_parallel_run
#define XSAMG1_IO_SETTINGS xsamg1_io_settings
#define XSAMG1_IO_SETTINGS2 xsamg1_io_settings2
#define XSAMG1_LAST_MSG xsamg1_last_msg
#define XSAMG1_READ_CONFIG xsamg1_read_config
#define XSAMG1_PRINT_INTERNAL_TIMER xsamg1_print_internal_timer
#define XSAMG1_ERROR_INFO xsamg1_error_info
#define XSAMG1_GET_IERR_ON_TAG_STOP xsamg1_get_ierr_on_tag_stop
#define XSAMG1_CONFIGFILE_MISSING xsamg1_configfile_missing
#define XSAMG1_LEAVE xsamg1_leave
#define XSAMG1_CLEANUP xsamg1_cleanup
#define SAMG1_DUMP_SEQUENCE_RESET samg1_dump_sequence_reset
#define SAMG1_GET_RESIDUAL_VECTOR_E samg1_get_residual_vector_e
#define SAMG1_GET_RESIDUAL_VECTOR_V samg1_get_residual_vector_v
#define SAMG1_RESIDUAL_VECTOR_LEAVE samg1_residual_vector_leave
#define SAMG1_SET_RESIDUAL_VECTOR_E samg1_set_residual_vector_e
#define SAMG1_SET_RESIDUAL_VECTOR_V samg1_set_residual_vector_v
#define SAMG1_SET_RESIDUAL_VECTOR_INIT samg1_set_residual_vector_init
#define XSAMG1_OIL xsamg1_oil
#define SAMG1_OIL samg1_oil
#define SAMG1_SET_RENUMBER_VEC samg1_set_renumber_vec
#define SAMG1_GET_RENUMBER_VEC samg1_get_renumber_vec
#define SAMG1_GETRE_NU samg1_getre_nu
#define SAMG1_GETDBLE_NU samg1_getdble_nu
#define SAMG1_GETINT_NU samg1_getint_nu
#define SAMG1_GETTE_NU samg1_gette_nu
#define SAMG1_GETLO_NU samg1_getlo_nu
#define SAMG1_GETSPEC_NU samg1_getspec_nu
#define SAMG1_SET_A_CMPLX_AGG_DEFAULT samg1_set_a_cmplx_agg_default
#define SAMG1_GET_A_CMPLX_AGG_DEFAULT samg1_get_a_cmplx_agg_default
#define SAMG1_SET_A_CMPLX_DEFAULT samg1_set_a_cmplx_default
#define SAMG1_GET_A_CMPLX_DEFAULT samg1_get_a_cmplx_default
#define SAMG1_SET_ALLOW_FILNAM_IN samg1_set_allow_filnam_in
#define SAMG1_GET_ALLOW_FILNAM_IN samg1_get_allow_filnam_in
#define SAMG1_SET_ALLOW_PRIVATE_IN samg1_set_allow_private_in
#define SAMG1_GET_ALLOW_PRIVATE_IN samg1_get_allow_private_in
#define SAMG1_SET_ALLOW_ELIM samg1_set_allow_elim
#define SAMG1_GET_ALLOW_ELIM samg1_get_allow_elim
#define SAMG1_SET_ALLUNS_AT_ALLPNTS samg1_set_alluns_at_allpnts
#define SAMG1_GET_ALLUNS_AT_ALLPNTS samg1_get_alluns_at_allpnts
#define SAMG1_SET_ART_TIME samg1_set_art_time
#define SAMG1_GET_ART_TIME samg1_get_art_time
#define SAMG1_SET_ART_TIME_CYC samg1_set_art_time_cyc
#define SAMG1_GET_ART_TIME_CYC samg1_get_art_time_cyc
#define SAMG1_SET_ART_TIME_CYC_2ND samg1_set_art_time_cyc_2nd
#define SAMG1_GET_ART_TIME_CYC_2ND samg1_get_art_time_cyc_2nd
#define SAMG1_SET_ART_TIME_SETUP samg1_set_art_time_setup
#define SAMG1_GET_ART_TIME_SETUP samg1_get_art_time_setup
#define SAMG1_SET_ART_TIME_SETUP_2ND samg1_set_art_time_setup_2nd
#define SAMG1_GET_ART_TIME_SETUP_2ND samg1_get_art_time_setup_2nd
#define SAMG1_SET_B_CMPLX samg1_set_b_cmplx
#define SAMG1_GET_B_CMPLX samg1_get_b_cmplx
#define SAMG1_SET_B_CMPLX_AGG_DEFAULT samg1_set_b_cmplx_agg_default
#define SAMG1_GET_B_CMPLX_AGG_DEFAULT samg1_get_b_cmplx_agg_default
#define SAMG1_SET_B_CMPLX_DEFAULT samg1_set_b_cmplx_default
#define SAMG1_GET_B_CMPLX_DEFAULT samg1_get_b_cmplx_default
#define SAMG1_SET_BACKUP samg1_set_backup
#define SAMG1_GET_BACKUP samg1_get_backup
#define SAMG1_SET_BLK_FILLEXP samg1_set_blk_fillexp
#define SAMG1_GET_BLK_FILLEXP samg1_get_blk_fillexp
#define SAMG1_SET_BLK_STAB samg1_set_blk_stab
#define SAMG1_GET_BLK_STAB samg1_get_blk_stab
#define SAMG1_SET_BLOCK_SCALE samg1_set_block_scale
#define SAMG1_GET_BLOCK_SCALE samg1_get_block_scale
#define SAMG1_SET_BLOCK_SCALE2 samg1_set_block_scale2
#define SAMG1_GET_BLOCK_SCALE2 samg1_get_block_scale2
#define SAMG1_SET_BLOCK_SCALE3 samg1_set_block_scale3
#define SAMG1_GET_BLOCK_SCALE3 samg1_get_block_scale3
#define SAMG1_SET_BS_AUTO_SIGN samg1_set_bs_auto_sign
#define SAMG1_GET_BS_AUTO_SIGN samg1_get_bs_auto_sign
#define SAMG1_SET_BS_MIN_BLOCK_SIZE samg1_set_bs_min_block_size
#define SAMG1_GET_BS_MIN_BLOCK_SIZE samg1_get_bs_min_block_size
#define SAMG1_SET_BS_OMP samg1_set_bs_omp
#define SAMG1_GET_BS_OMP samg1_get_bs_omp
#define SAMG1_ISET_BND_PARTITION_FILE samg1_iset_bnd_partition_file
#define SAMG1_IGET_BND_PARTITION_FILE samg1_iget_bnd_partition_file
#define SAMG1_SET_BND_PARTITION_FILE samg1_set_bnd_partition_file
#define SAMG1_GET_BND_PARTITION_FILE samg1_get_bnd_partition_file
#define SAMG1_SET_CHECK_ALLPNTS samg1_set_check_allpnts
#define SAMG1_GET_CHECK_ALLPNTS samg1_get_check_allpnts
#define SAMG1_SET_CHECK_ORDER samg1_set_check_order
#define SAMG1_GET_CHECK_ORDER samg1_get_check_order
#define SAMG1_SET_CHECK_BCSR_DUMP samg1_set_check_bcsr_dump
#define SAMG1_GET_CHECK_BCSR_DUMP samg1_get_check_bcsr_dump
#define SAMG1_SET_CL_CPL samg1_set_cl_cpl
#define SAMG1_GET_CL_CPL samg1_get_cl_cpl
#define SAMG1_SET_CL_ORDER samg1_set_cl_order
#define SAMG1_GET_CL_ORDER samg1_get_cl_order
#define SAMG1_SET_CL_OUTRES samg1_set_cl_outres
#define SAMG1_GET_CL_OUTRES samg1_get_cl_outres
#define SAMG1_SET_CL_LEVEL_DEP samg1_set_cl_level_dep
#define SAMG1_GET_CL_LEVEL_DEP samg1_get_cl_level_dep
#define SAMG1_SET_CL_AUTO_SIZE samg1_set_cl_auto_size
#define SAMG1_GET_CL_AUTO_SIZE samg1_get_cl_auto_size
#define SAMG1_SET_CL_PROC_BORDER samg1_set_cl_proc_border
#define SAMG1_GET_CL_PROC_BORDER samg1_get_cl_proc_border
#define SAMG1_SET_CL_QUALITY_MEASURE samg1_set_cl_quality_measure
#define SAMG1_GET_CL_QUALITY_MEASURE samg1_get_cl_quality_measure
#define SAMG1_SET_CL_GLOBAL_QUALITY samg1_set_cl_global_quality
#define SAMG1_GET_CL_GLOBAL_QUALITY samg1_get_cl_global_quality
#define SAMG1_SET_CL_OMP samg1_set_cl_omp
#define SAMG1_GET_CL_OMP samg1_get_cl_omp
#define SAMG1_SET_CL_CMK_REORDER samg1_set_cl_cmk_reorder
#define SAMG1_GET_CL_CMK_REORDER samg1_get_cl_cmk_reorder
#define SAMG1_SET_CLSOLVER_FINEST samg1_set_clsolver_finest
#define SAMG1_GET_CLSOLVER_FINEST samg1_get_clsolver_finest
#define SAMG1_SET_CLDENSE_CTRL samg1_set_cldense_ctrl
#define SAMG1_GET_CLDENSE_CTRL samg1_get_cldense_ctrl
#define SAMG1_SET_CONST_INT_GLK samg1_set_const_int_glk
#define SAMG1_GET_CONST_INT_GLK samg1_get_const_int_glk
#define SAMG1_SET_CONST_INT_SOL samg1_set_const_int_sol
#define SAMG1_GET_CONST_INT_SOL samg1_get_const_int_sol
#define SAMG1_SET_CNTRL_ENFORCE samg1_set_cntrl_enforce
#define SAMG1_GET_CNTRL_ENFORCE samg1_get_cntrl_enforce
#define SAMG1_SET_CNTRL_LOGFILE samg1_set_cntrl_logfile
#define SAMG1_GET_CNTRL_LOGFILE samg1_get_cntrl_logfile
#define SAMG1_SET_CNTRL_METHOD samg1_set_cntrl_method
#define SAMG1_GET_CNTRL_METHOD samg1_get_cntrl_method
#define SAMG1_SET_CNTRL_RELEASE samg1_set_cntrl_release
#define SAMG1_GET_CNTRL_RELEASE samg1_get_cntrl_release
#define SAMG1_SET_CNTRL_RES_DIFF samg1_set_cntrl_res_diff
#define SAMG1_GET_CNTRL_RES_DIFF samg1_get_cntrl_res_diff
#define SAMG1_SET_CNTRL_RETRY_ITER samg1_set_cntrl_retry_iter
#define SAMG1_GET_CNTRL_RETRY_ITER samg1_get_cntrl_retry_iter
#define SAMG1_SET_CNTRL_STEADY samg1_set_cntrl_steady
#define SAMG1_GET_CNTRL_STEADY samg1_get_cntrl_steady
#define SAMG1_SET_CONV_STOP samg1_set_conv_stop
#define SAMG1_GET_CONV_STOP samg1_get_conv_stop
#define SAMG1_SET_CORRECT_CLUSTER_INFO samg1_set_correct_cluster_info
#define SAMG1_GET_CORRECT_CLUSTER_INFO samg1_get_correct_cluster_info
#define SAMG1_SET_CSET_LASTPNT samg1_set_cset_lastpnt
#define SAMG1_GET_CSET_LASTPNT samg1_get_cset_lastpnt
#define SAMG1_SET_CSET_LESSVARS samg1_set_cset_lessvars
#define SAMG1_GET_CSET_LESSVARS samg1_get_cset_lessvars
#define SAMG1_SET_CSET_LONGROW samg1_set_cset_longrow
#define SAMG1_GET_CSET_LONGROW samg1_get_cset_longrow
#define SAMG1_ISET_CSET_READ samg1_iset_cset_read
#define SAMG1_IGET_CSET_READ samg1_iget_cset_read
#define SAMG1_SET_CSET_READ samg1_set_cset_read
#define SAMG1_GET_CSET_READ samg1_get_cset_read
#define SAMG1_SET_CSET_ZERODIAG samg1_set_cset_zerodiag
#define SAMG1_GET_CSET_ZERODIAG samg1_get_cset_zerodiag
#define SAMG1_SET_CSET_UNKNOWN samg1_set_cset_unknown
#define SAMG1_GET_CSET_UNKNOWN samg1_get_cset_unknown
#define SAMG1_SET_CSET_UNKNOWN1 samg1_set_cset_unknown1
#define SAMG1_GET_CSET_UNKNOWN1 samg1_get_cset_unknown1
#define SAMG1_SET_CSET_UNKNOWN2 samg1_set_cset_unknown2
#define SAMG1_GET_CSET_UNKNOWN2 samg1_get_cset_unknown2
#define SAMG1_SET_DELTA_MILU samg1_set_delta_milu
#define SAMG1_GET_DELTA_MILU samg1_get_delta_milu
#define SAMG1_SET_DENSX samg1_set_densx
#define SAMG1_GET_DENSX samg1_get_densx
#define SAMG1_SET_DIVERGENCE samg1_set_divergence
#define SAMG1_GET_DIVERGENCE samg1_get_divergence
#define SAMG1_SET_DIV_STOP_RULE samg1_set_div_stop_rule
#define SAMG1_GET_DIV_STOP_RULE samg1_get_div_stop_rule
#define SAMG1_SET_DIV_THRESHOLD samg1_set_div_threshold
#define SAMG1_GET_DIV_THRESHOLD samg1_get_div_threshold
#define SAMG1_SET_DROPTOL samg1_set_droptol
#define SAMG1_GET_DROPTOL samg1_get_droptol
#define SAMG1_SET_DROPTOL_CL samg1_set_droptol_cl
#define SAMG1_GET_DROPTOL_CL samg1_get_droptol_cl
#define SAMG1_SET_DROPTOL_2ND samg1_set_droptol_2nd
#define SAMG1_GET_DROPTOL_2ND samg1_get_droptol_2nd
#define SAMG1_SET_DROPTOL_SMO samg1_set_droptol_smo
#define SAMG1_GET_DROPTOL_SMO samg1_get_droptol_smo
#define SAMG1_SET_DUMP_APPROX_SOLUTION samg1_set_dump_approx_solution
#define SAMG1_GET_DUMP_APPROX_SOLUTION samg1_get_dump_approx_solution
#define SAMG1_SET_DUMP_CORRECTW samg1_set_dump_correctw
#define SAMG1_GET_DUMP_CORRECTW samg1_get_dump_correctw
#define SAMG1_SET_DUMP_GENERATED_SMOVEC samg1_set_dump_generated_smovec
#define SAMG1_GET_DUMP_GENERATED_SMOVEC samg1_get_dump_generated_smovec
#define SAMG1_SET_ECG samg1_set_ecg
#define SAMG1_GET_ECG samg1_get_ecg
#define SAMG1_SET_ECG_DEFAULT samg1_set_ecg_default
#define SAMG1_GET_ECG_DEFAULT samg1_get_ecg_default
#define SAMG1_SET_ICHOLESKY samg1_set_icholesky
#define SAMG1_GET_ICHOLESKY samg1_get_icholesky
#define SAMG1_SET_ENFORCE_FULLSMO samg1_set_enforce_fullsmo
#define SAMG1_GET_ENFORCE_FULLSMO samg1_get_enforce_fullsmo
#define SAMG1_SET_EPS_ABS samg1_set_eps_abs
#define SAMG1_GET_EPS_ABS samg1_get_eps_abs
#define SAMG1_SET_EPS_ACCEPT_JAC_UZAWA samg1_set_eps_accept_jac_uzawa
#define SAMG1_GET_EPS_ACCEPT_JAC_UZAWA samg1_get_eps_accept_jac_uzawa
#define SAMG1_SET_EPS_CONVERG_JAC_UZAWA samg1_set_eps_converg_jac_uzawa
#define SAMG1_GET_EPS_CONVERG_JAC_UZAWA samg1_get_eps_converg_jac_uzawa
#define SAMG1_SET_EPS_DD samg1_set_eps_dd
#define SAMG1_GET_EPS_DD samg1_get_eps_dd
#define SAMG1_SET_EPS_DIVERG_JAC_UZAWA samg1_set_eps_diverg_jac_uzawa
#define SAMG1_GET_EPS_DIVERG_JAC_UZAWA samg1_get_eps_diverg_jac_uzawa
#define SAMG1_SET_EPS_DIAG samg1_set_eps_diag
#define SAMG1_GET_EPS_DIAG samg1_get_eps_diag
#define SAMG1_SET_EPS_LSQ samg1_set_eps_lsq
#define SAMG1_GET_EPS_LSQ samg1_get_eps_lsq
#define SAMG1_SET_ETR samg1_set_etr
#define SAMG1_GET_ETR samg1_get_etr
#define SAMG1_SET_ETR_DEFAULT samg1_set_etr_default
#define SAMG1_GET_ETR_DEFAULT samg1_get_etr_default
#define SAMG1_SET_ETR2_SMO samg1_set_etr2_smo
#define SAMG1_GET_ETR2_SMO samg1_get_etr2_smo
#define SAMG1_SET_EWT samg1_set_ewt
#define SAMG1_GET_EWT samg1_get_ewt
#define SAMG1_SET_EWT_DEFAULT samg1_set_ewt_default
#define SAMG1_GET_EWT_DEFAULT samg1_get_ewt_default
#define SAMG1_SET_FACTOR_APP_VAR samg1_set_factor_app_var
#define SAMG1_GET_FACTOR_APP_VAR samg1_get_factor_app_var
#define SAMG1_SET_FACTOR_QUASI_RES samg1_set_factor_quasi_res
#define SAMG1_GET_FACTOR_QUASI_RES samg1_get_factor_quasi_res
#define SAMG1_SET_FACTOR_RES_VAR samg1_set_factor_res_var
#define SAMG1_GET_FACTOR_RES_VAR samg1_get_factor_res_var
#define SAMG1_SET_FACTOR_MATRIX_SCALE samg1_set_factor_matrix_scale
#define SAMG1_GET_FACTOR_MATRIX_SCALE samg1_get_factor_matrix_scale
#define SAMG1_SET_FACTOR_SOL_JAC_UZAWA samg1_set_factor_sol_jac_uzawa
#define SAMG1_GET_FACTOR_SOL_JAC_UZAWA samg1_get_factor_sol_jac_uzawa
#define SAMG1_ISET_FILNAM samg1_iset_filnam
#define SAMG1_IGET_FILNAM samg1_iget_filnam
#define SAMG1_SET_FILNAM samg1_set_filnam
#define SAMG1_GET_FILNAM samg1_get_filnam
#define SAMG1_ISET_FILNAM_DUMPSOL samg1_iset_filnam_dumpsol
#define SAMG1_IGET_FILNAM_DUMPSOL samg1_iget_filnam_dumpsol
#define SAMG1_SET_FILNAM_DUMPSOL samg1_set_filnam_dumpsol
#define SAMG1_GET_FILNAM_DUMPSOL samg1_get_filnam_dumpsol
#define SAMG1_ISET_FILNAM_DUMP samg1_iset_filnam_dump
#define SAMG1_IGET_FILNAM_DUMP samg1_iget_filnam_dump
#define SAMG1_SET_FILNAM_DUMP samg1_set_filnam_dump
#define SAMG1_GET_FILNAM_DUMP samg1_get_filnam_dump
#define SAMG1_ISET_FILNAM_UZAWA samg1_iset_filnam_uzawa
#define SAMG1_IGET_FILNAM_UZAWA samg1_iget_filnam_uzawa
#define SAMG1_SET_FILNAM_UZAWA samg1_set_filnam_uzawa
#define SAMG1_GET_FILNAM_UZAWA samg1_get_filnam_uzawa
#define SAMG1_SET_FLEX_PCG_LITE samg1_set_flex_pcg_lite
#define SAMG1_GET_FLEX_PCG_LITE samg1_get_flex_pcg_lite
#define SAMG1_SET_FORCE_ACCEL samg1_set_force_accel
#define SAMG1_GET_FORCE_ACCEL samg1_get_force_accel
#define SAMG1_SET_FORCE_ACCEL_2ND samg1_set_force_accel_2nd
#define SAMG1_GET_FORCE_ACCEL_2ND samg1_get_force_accel_2nd
#define SAMG1_SET_FULL_PIVOTING samg1_set_full_pivoting
#define SAMG1_GET_FULL_PIVOTING samg1_get_full_pivoting
#define SAMG1_SET_FULL_SETUP samg1_set_full_setup
#define SAMG1_GET_FULL_SETUP samg1_get_full_setup
#define SAMG1_SET_G_CMPLX_AGG_DEFAULT samg1_set_g_cmplx_agg_default
#define SAMG1_GET_G_CMPLX_AGG_DEFAULT samg1_get_g_cmplx_agg_default
#define SAMG1_SET_G_CMPLX_DEFAULT samg1_set_g_cmplx_default
#define SAMG1_GET_G_CMPLX_DEFAULT samg1_get_g_cmplx_default
#define SAMG1_SET_GALERKIN_TIMER samg1_set_galerkin_timer
#define SAMG1_GET_GALERKIN_TIMER samg1_get_galerkin_timer
#define SAMG1_SET_GLK_MULT_ZEROS samg1_set_glk_mult_zeros
#define SAMG1_GET_GLK_MULT_ZEROS samg1_get_glk_mult_zeros
#define SAMG1_SET_GMAX_MULTIPASS samg1_set_gmax_multipass
#define SAMG1_GET_GMAX_MULTIPASS samg1_get_gmax_multipass
#define SAMG1_SET_IAGGREGATION_PROFILE samg1_set_iaggregation_profile
#define SAMG1_GET_IAGGREGATION_PROFILE samg1_get_iaggregation_profile
#define SAMG1_SET_IAGGREGATION samg1_set_iaggregation
#define SAMG1_GET_IAGGREGATION samg1_get_iaggregation
#define SAMG1_SET_IALL_SMO samg1_set_iall_smo
#define SAMG1_GET_IALL_SMO samg1_get_iall_smo
#define SAMG1_SET_IAUTO_OMEGA_JACOBI samg1_set_iauto_omega_jacobi
#define SAMG1_GET_IAUTO_OMEGA_JACOBI samg1_get_iauto_omega_jacobi
#define SAMG1_SET_IAUTO_OMEGA_SMOAGG samg1_set_iauto_omega_smoagg
#define SAMG1_GET_IAUTO_OMEGA_SMOAGG samg1_get_iauto_omega_smoagg
#define SAMG1_SET_IAUTO_STOP samg1_set_iauto_stop
#define SAMG1_GET_IAUTO_STOP samg1_get_iauto_stop
#define SAMG1_SET_IDUMP_SEQUENCE_START samg1_set_idump_sequence_start
#define SAMG1_GET_IDUMP_SEQUENCE_START samg1_get_idump_sequence_start
#define SAMG1_SET_IDUMP_SEQUENCE_END samg1_set_idump_sequence_end
#define SAMG1_GET_IDUMP_SEQUENCE_END samg1_get_idump_sequence_end
#define SAMG1_SET_ISTAB_CG samg1_set_istab_cg
#define SAMG1_GET_ISTAB_CG samg1_get_istab_cg
#define SAMG1_SET_IELASTICITY_PROFILE samg1_set_ielasticity_profile
#define SAMG1_GET_IELASTICITY_PROFILE samg1_get_ielasticity_profile
#define SAMG1_SET_IELASTICITY samg1_set_ielasticity
#define SAMG1_GET_IELASTICITY samg1_get_ielasticity
#define SAMG1_SET_IESTIM_SPECT_RADIUS samg1_set_iestim_spect_radius
#define SAMG1_GET_IESTIM_SPECT_RADIUS samg1_get_iestim_spect_radius
#define SAMG1_SET_IESTIM_SMOOTH_NIT samg1_set_iestim_smooth_nit
#define SAMG1_GET_IESTIM_SMOOTH_NIT samg1_get_iestim_smooth_nit
#define SAMG1_SET_INIT_RES_TREATMENT samg1_set_init_res_treatment
#define SAMG1_GET_INIT_RES_TREATMENT samg1_get_init_res_treatment
#define SAMG1_SET_IPRNT_RES_ACCURACY samg1_set_iprnt_res_accuracy
#define SAMG1_GET_IPRNT_RES_ACCURACY samg1_get_iprnt_res_accuracy
#define SAMG1_SET_ISMO2DFL samg1_set_ismo2dfl
#define SAMG1_GET_ISMO2DFL samg1_get_ismo2dfl
#define SAMG1_SET_ISMOAGG_AGGRESSIVE samg1_set_ismoagg_aggressive
#define SAMG1_GET_ISMOAGG_AGGRESSIVE samg1_get_ismoagg_aggressive
#define SAMG1_SET_ISMOAGG_OVERCORRECTION samg1_set_ismoagg_overcorrection
#define SAMG1_GET_ISMOAGG_OVERCORRECTION samg1_get_ismoagg_overcorrection
#define SAMG1_SET_ISMOAGG_OPTIM samg1_set_ismoagg_optim
#define SAMG1_GET_ISMOAGG_OPTIM samg1_get_ismoagg_optim
#define SAMG1_SET_ISMOAGG_BLOCK_TYP samg1_set_ismoagg_block_typ
#define SAMG1_GET_ISMOAGG_BLOCK_TYP samg1_get_ismoagg_block_typ
#define SAMG1_SET_ISMOAGG_COMPRESSION samg1_set_ismoagg_compression
#define SAMG1_GET_ISMOAGG_COMPRESSION samg1_get_ismoagg_compression
#define SAMG1_SET_ISMOAGG_FILTER_TYP samg1_set_ismoagg_filter_typ
#define SAMG1_GET_ISMOAGG_FILTER_TYP samg1_get_ismoagg_filter_typ
#define SAMG1_SET_ISMOAGG_SMOOTH_TYP samg1_set_ismoagg_smooth_typ
#define SAMG1_GET_ISMOAGG_SMOOTH_TYP samg1_get_ismoagg_smooth_typ
#define SAMG1_SET_ISMOAGG_SMOOTH_NIT samg1_set_ismoagg_smooth_nit
#define SAMG1_GET_ISMOAGG_SMOOTH_NIT samg1_get_ismoagg_smooth_nit
#define SAMG1_SET_ISMOAGG_SMOOTH_1LEV samg1_set_ismoagg_smooth_1lev
#define SAMG1_GET_ISMOAGG_SMOOTH_1LEV samg1_get_ismoagg_smooth_1lev
#define SAMG1_SET_ISMOAGG_SMOOTH_NLEV samg1_set_ismoagg_smooth_nlev
#define SAMG1_GET_ISMOAGG_SMOOTH_NLEV samg1_get_ismoagg_smooth_nlev
#define SAMG1_SET_IB_CMPLX samg1_set_ib_cmplx
#define SAMG1_GET_IB_CMPLX samg1_get_ib_cmplx
#define SAMG1_SET_IB_CMPLX_AGG_DEFAULT samg1_set_ib_cmplx_agg_default
#define SAMG1_GET_IB_CMPLX_AGG_DEFAULT samg1_get_ib_cmplx_agg_default
#define SAMG1_SET_IB_CMPLX_DEFAULT samg1_set_ib_cmplx_default
#define SAMG1_GET_IB_CMPLX_DEFAULT samg1_get_ib_cmplx_default
#define SAMG1_SET_IBGS_PIVOT samg1_set_ibgs_pivot
#define SAMG1_GET_IBGS_PIVOT samg1_get_ibgs_pivot
#define SAMG1_SET_ICASE_JAC_UZAWA samg1_set_icase_jac_uzawa
#define SAMG1_GET_ICASE_JAC_UZAWA samg1_get_icase_jac_uzawa
#define SAMG1_SET_ISTATISTICS_SMOVEC samg1_set_istatistics_smovec
#define SAMG1_GET_ISTATISTICS_SMOVEC samg1_get_istatistics_smovec
#define SAMG1_SET_ICHECK_SMOINT samg1_set_icheck_smoint
#define SAMG1_GET_ICHECK_SMOINT samg1_get_icheck_smoint
#define SAMG1_SET_ICOLOR_OMP samg1_set_icolor_omp
#define SAMG1_GET_ICOLOR_OMP samg1_get_icolor_omp
#define SAMG1_SET_IORDERED_OMP samg1_set_iordered_omp
#define SAMG1_GET_IORDERED_OMP samg1_get_iordered_omp
#define SAMG1_SET_ICRITS samg1_set_icrits
#define SAMG1_GET_ICRITS samg1_get_icrits
#define SAMG1_SET_IDTEST_UZAWA samg1_set_idtest_uzawa
#define SAMG1_GET_IDTEST_UZAWA samg1_get_idtest_uzawa
#define SAMG1_SET_IHUGE samg1_set_ihuge
#define SAMG1_GET_IHUGE samg1_get_ihuge
#define SAMG1_SET_IJAC_UZAWA samg1_set_ijac_uzawa
#define SAMG1_GET_IJAC_UZAWA samg1_get_ijac_uzawa
#define SAMG1_SET_ILU4ALLSCHWARZ samg1_set_ilu4allschwarz
