openCSMP/openCSMP/lib/samg/samg1.h
#define SAMG1_GET_ILU4ALLSCHWARZ samg1_get_ilu4allschwarz
#define SAMG1_SET_ILU_SPEED samg1_set_ilu_speed
#define SAMG1_GET_ILU_SPEED samg1_get_ilu_speed
#define SAMG1_SET_IMPLDO_READ_WRITE_LEN samg1_set_impldo_read_write_len
#define SAMG1_GET_IMPLDO_READ_WRITE_LEN samg1_get_impldo_read_write_len
#define SAMG1_SET_INFO_KEEPMEM samg1_set_info_keepmem
#define SAMG1_GET_INFO_KEEPMEM samg1_get_info_keepmem
#define SAMG1_SET_INNER_ACCEL samg1_set_inner_accel
#define SAMG1_GET_INNER_ACCEL samg1_get_inner_accel
#define SAMG1_SET_IODUMP samg1_set_iodump
#define SAMG1_GET_IODUMP samg1_get_iodump
#define SAMG1_ISET_IOFILE_OPTA samg1_iset_iofile_opta
#define SAMG1_IGET_IOFILE_OPTA samg1_iget_iofile_opta
#define SAMG1_SET_IOFILE_OPTA samg1_set_iofile_opta
#define SAMG1_GET_IOFILE_OPTA samg1_get_iofile_opta
#define SAMG1_ISET_IOFORM samg1_iset_ioform
#define SAMG1_IGET_IOFORM samg1_iget_ioform
#define SAMG1_SET_IOFORM samg1_set_ioform
#define SAMG1_GET_IOFORM samg1_get_ioform
#define SAMG1_SET_IOGRID samg1_set_iogrid
#define SAMG1_GET_IOGRID samg1_get_iogrid
#define SAMG1_SET_IOMOVIE samg1_set_iomovie
#define SAMG1_GET_IOMOVIE samg1_get_iomovie
#define SAMG1_SET_IOSCRATCH_DEFAULT samg1_set_ioscratch_default
#define SAMG1_GET_IOSCRATCH_DEFAULT samg1_get_ioscratch_default
#define SAMG1_SET_IOUNIT_OPTA samg1_set_iounit_opta
#define SAMG1_GET_IOUNIT_OPTA samg1_get_iounit_opta
#define SAMG1_SET_IPASS_MAX_SET samg1_set_ipass_max_set
#define SAMG1_GET_IPASS_MAX_SET samg1_get_ipass_max_set
#define SAMG1_SET_IRESTRICTION_OPENMP samg1_set_irestriction_openmp
#define SAMG1_GET_IRESTRICTION_OPENMP samg1_get_irestriction_openmp
#define SAMG1_SET_IPRESSURE_UZAWA samg1_set_ipressure_uzawa
#define SAMG1_GET_IPRESSURE_UZAWA samg1_get_ipressure_uzawa
#define SAMG1_SET_IPROFILE_GEOMETRIC samg1_set_iprofile_geometric
#define SAMG1_GET_IPROFILE_GEOMETRIC samg1_get_iprofile_geometric
#define SAMG1_SET_ISAT_UZAWA samg1_set_isat_uzawa
#define SAMG1_GET_ISAT_UZAWA samg1_get_isat_uzawa
#define SAMG1_SET_ISET_VIO_DD samg1_set_iset_vio_dd
#define SAMG1_GET_ISET_VIO_DD samg1_get_iset_vio_dd
#define SAMG1_SET_ISSTEP_UZAWA samg1_set_isstep_uzawa
#define SAMG1_GET_ISSTEP_UZAWA samg1_get_isstep_uzawa
#define SAMG1_SET_ISTEP1CASE_UZAWA samg1_set_istep1case_uzawa
#define SAMG1_GET_ISTEP1CASE_UZAWA samg1_get_istep1case_uzawa
#define SAMG1_SET_ISTEERING samg1_set_isteering
#define SAMG1_GET_ISTEERING samg1_get_isteering
#define SAMG1_SET_ISWIT3_USER samg1_set_iswit3_user
#define SAMG1_GET_ISWIT3_USER samg1_get_iswit3_user
#define SAMG1_SET_ITER_CHECK samg1_set_iter_check
#define SAMG1_GET_ITER_CHECK samg1_get_iter_check
#define SAMG1_SET_ITER_MATRIX_SCALE samg1_set_iter_matrix_scale
#define SAMG1_GET_ITER_MATRIX_SCALE samg1_get_iter_matrix_scale
#define SAMG1_SET_ITER_PRE samg1_set_iter_pre
#define SAMG1_GET_ITER_PRE samg1_get_iter_pre
#define SAMG1_SET_ITMAX_CONV samg1_set_itmax_conv
#define SAMG1_GET_ITMAX_CONV samg1_get_itmax_conv
#define SAMG1_SET_ITRACE_AMGMAIN samg1_set_itrace_amgmain
#define SAMG1_GET_ITRACE_AMGMAIN samg1_get_itrace_amgmain
#define SAMG1_SET_ITRACELEVEL samg1_set_itracelevel
#define SAMG1_GET_ITRACELEVEL samg1_get_itracelevel
#define SAMG1_SET_ITRACE_CLSOL samg1_set_itrace_clsol
#define SAMG1_GET_ITRACE_CLSOL samg1_get_itrace_clsol
#define SAMG1_SET_ITRACE_CLDENSE samg1_set_itrace_cldense
#define SAMG1_GET_ITRACE_CLDENSE samg1_get_itrace_cldense
#define SAMG1_SET_ITRACE_DIVSTOP samg1_set_itrace_divstop
#define SAMG1_GET_ITRACE_DIVSTOP samg1_get_itrace_divstop
#define SAMG1_SET_ITRACE_JAC_UZAWA samg1_set_itrace_jac_uzawa
#define SAMG1_GET_ITRACE_JAC_UZAWA samg1_get_itrace_jac_uzawa
#define SAMG1_SET_ITRACE_MK_REGULAR samg1_set_itrace_mk_regular
#define SAMG1_GET_ITRACE_MK_REGULAR samg1_get_itrace_mk_regular
#define SAMG1_SET_ITRACE_MATRIX_MODE samg1_set_itrace_matrix_mode
#define SAMG1_GET_ITRACE_MATRIX_MODE samg1_get_itrace_matrix_mode
#define SAMG1_SET_ITRACE_MATRIX_STORAGE samg1_set_itrace_matrix_storage
#define SAMG1_GET_ITRACE_MATRIX_STORAGE samg1_get_itrace_matrix_storage
#define SAMG1_SET_ITRACE_SCHWARZ samg1_set_itrace_schwarz
#define SAMG1_GET_ITRACE_SCHWARZ samg1_get_itrace_schwarz
#define SAMG1_SET_ITRACE_SMO samg1_set_itrace_smo
#define SAMG1_GET_ITRACE_SMO samg1_get_itrace_smo
#define SAMG1_SET_ITRACE_SOL samg1_set_itrace_sol
#define SAMG1_GET_ITRACE_SOL samg1_get_itrace_sol
#define SAMG1_SET_ITRACE_SPLIT samg1_set_itrace_split
#define SAMG1_GET_ITRACE_SPLIT samg1_get_itrace_split
#define SAMG1_SET_ITRACE_UZAWA samg1_set_itrace_uzawa
#define SAMG1_GET_ITRACE_UZAWA samg1_get_itrace_uzawa
#define SAMG1_SET_SMOAGG_NOQR samg1_set_smoagg_noqr
#define SAMG1_GET_SMOAGG_NOQR samg1_get_smoagg_noqr
#define SAMG1_SET_STACKTRACE samg1_set_stacktrace
#define SAMG1_GET_STACKTRACE samg1_get_stacktrace
#define SAMG1_SET_STORE_PGS_FACTOR samg1_set_store_pgs_factor
#define SAMG1_GET_STORE_PGS_FACTOR samg1_get_store_pgs_factor
#define SAMG1_SET_KCYCLE_PROFILE samg1_set_kcycle_profile
#define SAMG1_GET_KCYCLE_PROFILE samg1_get_kcycle_profile
#define SAMG1_SET_KEEPMEM samg1_set_keepmem
#define SAMG1_GET_KEEPMEM samg1_get_keepmem
#define SAMG1_SET_K_DISABLE_KRYLOV1 samg1_set_k_disable_krylov1
#define SAMG1_GET_K_DISABLE_KRYLOV1 samg1_get_k_disable_krylov1
#define SAMG1_SET_K_DYNCYC samg1_set_k_dyncyc
#define SAMG1_GET_K_DYNCYC samg1_get_k_dyncyc
#define SAMG1_SET_LASTGRID samg1_set_lastgrid
#define SAMG1_GET_LASTGRID samg1_get_lastgrid
#define SAMG1_SET_LEV_COARSENING_TOO_SLOW samg1_set_lev_coarsening_too_slow
#define SAMG1_GET_LEV_COARSENING_TOO_SLOW samg1_get_lev_coarsening_too_slow
#define SAMG1_SET_LEVELS_UZAWA samg1_set_levels_uzawa
#define SAMG1_GET_LEVELS_UZAWA samg1_get_levels_uzawa
#define SAMG1_SET_LEVELX samg1_set_levelx
#define SAMG1_GET_LEVELX samg1_get_levelx
#define SAMG1_SET_LEVELX_2ND samg1_set_levelx_2nd
#define SAMG1_GET_LEVELX_2ND samg1_get_levelx_2nd
#define SAMG1_SET_LFIL_CL samg1_set_lfil_cl
#define SAMG1_GET_LFIL_CL samg1_get_lfil_cl
#define SAMG1_SET_LFIL_2ND samg1_set_lfil_2nd
#define SAMG1_GET_LFIL_2ND samg1_get_lfil_2nd
#define SAMG1_SET_LFIL_SMO samg1_set_lfil_smo
#define SAMG1_GET_LFIL_SMO samg1_get_lfil_smo
#define SAMG1_ISET_LOGFILE samg1_iset_logfile
#define SAMG1_IGET_LOGFILE samg1_iget_logfile
#define SAMG1_SET_LOGFILE samg1_set_logfile
#define SAMG1_GET_LOGFILE samg1_get_logfile
#define SAMG1_SET_LOGIO samg1_set_logio
#define SAMG1_GET_LOGIO samg1_get_logio
#define SAMG1_SET_LU_REUSE samg1_set_lu_reuse
#define SAMG1_GET_LU_REUSE samg1_get_lu_reuse
#define SAMG1_SET_MATRIX_MODE samg1_set_matrix_mode
#define SAMG1_GET_MATRIX_MODE samg1_get_matrix_mode
#define SAMG1_SET_MATRIX_FORMAT samg1_set_matrix_format
#define SAMG1_GET_MATRIX_FORMAT samg1_get_matrix_format
#define SAMG1_SET_MATRIX_SCALE_RENORM samg1_set_matrix_scale_renorm
#define SAMG1_GET_MATRIX_SCALE_RENORM samg1_get_matrix_scale_renorm
#define SAMG1_SET_MAX_CALLS samg1_set_max_calls
#define SAMG1_GET_MAX_CALLS samg1_get_max_calls
#define SAMG1_SET_MAX_CL_SIZE samg1_set_max_cl_size
#define SAMG1_GET_MAX_CL_SIZE samg1_get_max_cl_size
#define SAMG1_SET_MAXCORR_CLUSTER samg1_set_maxcorr_cluster
#define SAMG1_GET_MAXCORR_CLUSTER samg1_get_maxcorr_cluster
#define SAMG1_SET_MAX_LEVEL samg1_set_max_level
#define SAMG1_GET_MAX_LEVEL samg1_get_max_level
#define SAMG1_SET_MAX_NB_LIST_SIZE samg1_set_max_nb_list_size
#define SAMG1_GET_MAX_NB_LIST_SIZE samg1_get_max_nb_list_size
#define SAMG1_SET_MAXITER_JAC_UZAWA samg1_set_maxiter_jac_uzawa
#define SAMG1_GET_MAXITER_JAC_UZAWA samg1_get_maxiter_jac_uzawa
#define SAMG1_SET_MAXOP_RESTART samg1_set_maxop_restart
#define SAMG1_GET_MAXOP_RESTART samg1_get_maxop_restart
#define SAMG1_SET_MAXRETRY_JAC_UZAWA samg1_set_maxretry_jac_uzawa
#define SAMG1_GET_MAXRETRY_JAC_UZAWA samg1_get_maxretry_jac_uzawa
#define SAMG1_SET_MILU samg1_set_milu
#define SAMG1_GET_MILU samg1_get_milu
#define SAMG1_SET_MIN_CL_SIZE samg1_set_min_cl_size
#define SAMG1_GET_MIN_CL_SIZE samg1_get_min_cl_size
#define SAMG1_SET_MIN_MULTI_SIZE samg1_set_min_multi_size
#define SAMG1_GET_MIN_MULTI_SIZE samg1_get_min_multi_size
#define SAMG1_SET_MINITER_JAC_UZAWA samg1_set_miniter_jac_uzawa
#define SAMG1_GET_MINITER_JAC_UZAWA samg1_get_miniter_jac_uzawa
#define SAMG1_SET_MK_REGULAR samg1_set_mk_regular
#define SAMG1_GET_MK_REGULAR samg1_get_mk_regular
#define SAMG1_SET_MODE_CNTRL samg1_set_mode_cntrl
#define SAMG1_GET_MODE_CNTRL samg1_get_mode_cntrl
#define SAMG1_SET_MODE_DEBUG samg1_set_mode_debug
#define SAMG1_GET_MODE_DEBUG samg1_get_mode_debug
#define SAMG1_SET_MODE_MESS samg1_set_mode_mess
#define SAMG1_GET_MODE_MESS samg1_get_mode_mess
#define SAMG1_SET_MODIFY_MAT samg1_set_modify_mat
#define SAMG1_GET_MODIFY_MAT samg1_get_modify_mat
#define SAMG1_SET_MODIFY_RESTRICTION samg1_set_modify_restriction
#define SAMG1_GET_MODIFY_RESTRICTION samg1_get_modify_restriction
#define SAMG1_SET_MULTIPASS_ALLCOUP samg1_set_multipass_allcoup
#define SAMG1_GET_MULTIPASS_ALLCOUP samg1_get_multipass_allcoup
#define SAMG1_SET_NBLK_DEBUG samg1_set_nblk_debug
#define SAMG1_GET_NBLK_DEBUG samg1_get_nblk_debug
#define SAMG1_SET_NBLK_MAX samg1_set_nblk_max
#define SAMG1_GET_NBLK_MAX samg1_get_nblk_max
#define SAMG1_SET_NBLK_OVERLAP samg1_set_nblk_overlap
#define SAMG1_GET_NBLK_OVERLAP samg1_get_nblk_overlap
#define SAMG1_SET_NBLK_RESID samg1_set_nblk_resid
#define SAMG1_GET_NBLK_RESID samg1_get_nblk_resid
#define SAMG1_SET_NBLK_SOLVE samg1_set_nblk_solve
#define SAMG1_GET_NBLK_SOLVE samg1_get_nblk_solve
#define SAMG1_SET_NBLK_SOLVER samg1_set_nblk_solver
#define SAMG1_GET_NBLK_SOLVER samg1_get_nblk_solver
#define SAMG1_SET_NBND_OMEGA samg1_set_nbnd_omega
#define SAMG1_GET_NBND_OMEGA samg1_get_nbnd_omega
#define SAMG1_SET_NBND_OMEGA_UZAWA samg1_set_nbnd_omega_uzawa
#define SAMG1_GET_NBND_OMEGA_UZAWA samg1_get_nbnd_omega_uzawa
#define SAMG1_SET_NBND_SWEEPS samg1_set_nbnd_sweeps
#define SAMG1_GET_NBND_SWEEPS samg1_get_nbnd_sweeps
#define SAMG1_SET_NBND_SWEEPS_UZAWA samg1_set_nbnd_sweeps_uzawa
#define SAMG1_GET_NBND_SWEEPS_UZAWA samg1_get_nbnd_sweeps_uzawa
#define SAMG1_SET_NCOLOR_BLOCK_GS samg1_set_ncolor_block_gs
#define SAMG1_GET_NCOLOR_BLOCK_GS samg1_get_ncolor_block_gs
#define SAMG1_SET_NCOLOR_BLOCK_GS_MSG samg1_set_ncolor_block_gs_msg
#define SAMG1_GET_NCOLOR_BLOCK_GS_MSG samg1_get_ncolor_block_gs_msg
#define SAMG1_SET_NCOLOR_BLOCK_GS_RESCHK samg1_set_ncolor_block_gs_reschk
#define SAMG1_GET_NCOLOR_BLOCK_GS_RESCHK samg1_get_ncolor_block_gs_reschk
#define SAMG1_SET_NDEGREE_CHEBY samg1_set_ndegree_cheby
#define SAMG1_GET_NDEGREE_CHEBY samg1_get_ndegree_cheby
#define SAMG1_SET_NCFRAMES samg1_set_ncframes
#define SAMG1_GET_NCFRAMES samg1_get_ncframes
#define SAMG1_SET_NCG samg1_set_ncg
#define SAMG1_GET_NCG samg1_get_ncg
#define SAMG1_SET_NCGRAD_DEFAULT samg1_set_ncgrad_default
#define SAMG1_GET_NCGRAD_DEFAULT samg1_get_ncgrad_default
#define SAMG1_SET_NCYC_DEFAULT samg1_set_ncyc_default
#define SAMG1_GET_NCYC_DEFAULT samg1_get_ncyc_default
#define SAMG1_SET_NCYC_MIN samg1_set_ncyc_min
#define SAMG1_GET_NCYC_MIN samg1_get_ncyc_min
#define SAMG1_SET_NCYC_2ND samg1_set_ncyc_2nd
#define SAMG1_GET_NCYC_2ND samg1_get_ncyc_2nd
#define SAMG1_SET_NCYC_START samg1_set_ncyc_start
#define SAMG1_GET_NCYC_START samg1_get_ncyc_start
#define SAMG1_SET_NDYN_SMO samg1_set_ndyn_smo
#define SAMG1_GET_NDYN_SMO samg1_get_ndyn_smo
#define SAMG1_SET_NEG_DIAG samg1_set_neg_diag
#define SAMG1_GET_NEG_DIAG samg1_get_neg_diag
#define SAMG1_SET_NEG_DIAG_BRUTE samg1_set_neg_diag_brute
#define SAMG1_GET_NEG_DIAG_BRUTE samg1_get_neg_diag_brute
#define SAMG1_SET_NEW_ENTRIES samg1_set_new_entries
#define SAMG1_GET_NEW_ENTRIES samg1_get_new_entries
#define SAMG1_SET_NEW_TOPOLOGY samg1_set_new_topology
#define SAMG1_GET_NEW_TOPOLOGY samg1_get_new_topology
#define SAMG1_SET_NILU_REORDER samg1_set_nilu_reorder
#define SAMG1_GET_NILU_REORDER samg1_get_nilu_reorder
#define SAMG1_SET_NINCR_RES_ACCEPTED_MG samg1_set_nincr_res_accepted_mg
#define SAMG1_GET_NINCR_RES_ACCEPTED_MG samg1_get_nincr_res_accepted_mg
#define SAMG1_SET_NINCR_RES_ACCEPTED_1G samg1_set_nincr_res_accepted_1g
#define SAMG1_GET_NINCR_RES_ACCEPTED_1G samg1_get_nincr_res_accepted_1g
#define SAMG1_SET_NINT_ROWSUM1 samg1_set_nint_rowsum1
#define SAMG1_GET_NINT_ROWSUM1 samg1_get_nint_rowsum1
#define SAMG1_SET_NINTER_OMP samg1_set_ninter_omp
#define SAMG1_GET_NINTER_OMP samg1_get_ninter_omp
#define SAMG1_SET_NITER_SKIP samg1_set_niter_skip
#define SAMG1_GET_NITER_SKIP samg1_get_niter_skip
#define SAMG1_SET_NKCYCLE samg1_set_nkcycle
#define SAMG1_GET_NKCYCLE samg1_get_nkcycle
#define SAMG1_SET_NKDIM_DEFAULT samg1_set_nkdim_default
#define SAMG1_GET_NKDIM_DEFAULT samg1_get_nkdim_default
#define SAMG1_SET_NSMOOTH_COO_POLY samg1_set_nsmooth_coo_poly
#define SAMG1_GET_NSMOOTH_COO_POLY samg1_get_nsmooth_coo_poly
#define SAMG1_SET_NSMOAGG samg1_set_nsmoagg
#define SAMG1_GET_NSMOAGG samg1_get_nsmoagg
#define SAMG1_SET_NSMOAGG1LEV samg1_set_nsmoagg1lev
#define SAMG1_GET_NSMOAGG1LEV samg1_get_nsmoagg1lev
#define SAMG1_SET_NSMOAGGLEV samg1_set_nsmoagglev
#define SAMG1_GET_NSMOAGGLEV samg1_get_nsmoagglev
#define SAMG1_SET_NMIN_MATRIX samg1_set_nmin_matrix
#define SAMG1_GET_NMIN_MATRIX samg1_get_nmin_matrix
#define SAMG1_SET_NMIN_MATRIX_RESC samg1_set_nmin_matrix_resc
#define SAMG1_GET_NMIN_MATRIX_RESC samg1_get_nmin_matrix_resc
#define SAMG1_SET_NMIN_VECTOR samg1_set_nmin_vector
#define SAMG1_GET_NMIN_VECTOR samg1_get_nmin_vector
#define SAMG1_SET_NOTALLUNS_CHEAP samg1_set_notalluns_cheap
#define SAMG1_GET_NOTALLUNS_CHEAP samg1_get_notalluns_cheap
#define SAMG1_SET_NP_MOD1 samg1_set_np_mod1
#define SAMG1_GET_NP_MOD1 samg1_get_np_mod1
#define SAMG1_SET_NP_MOD2 samg1_set_np_mod2
#define SAMG1_GET_NP_MOD2 samg1_get_np_mod2
#define SAMG1_SET_NP_OPT samg1_set_np_opt
#define SAMG1_GET_NP_OPT samg1_get_np_opt
#define SAMG1_SET_NPRIM_AT_ALLPNTS samg1_set_nprim_at_allpnts
#define SAMG1_GET_NPRIM_AT_ALLPNTS samg1_get_nprim_at_allpnts
#define SAMG1_SET_NPTMAX samg1_set_nptmax
#define SAMG1_GET_NPTMAX samg1_get_nptmax
#define SAMG1_SET_NPTMN samg1_set_nptmn
#define SAMG1_GET_NPTMN samg1_get_nptmn
#define SAMG1_SET_NRC samg1_set_nrc
#define SAMG1_GET_NRC samg1_get_nrc
#define SAMG1_SET_NRC_EMERGENCY samg1_set_nrc_emergency
#define SAMG1_GET_NRC_EMERGENCY samg1_get_nrc_emergency
#define SAMG1_SET_NRD samg1_set_nrd
#define SAMG1_GET_NRD samg1_get_nrd
#define SAMG1_SET_NRD_2ND samg1_set_nrd_2nd
#define SAMG1_GET_NRD_2ND samg1_get_nrd_2nd
#define SAMG1_SET_NRU samg1_set_nru
#define SAMG1_GET_NRU samg1_get_nru
#define SAMG1_SET_NRU_2ND samg1_set_nru_2nd
#define SAMG1_GET_NRU_2ND samg1_get_nru_2nd
#define SAMG1_SET_NSIMPLE_EMERGENCY samg1_set_nsimple_emergency
#define SAMG1_GET_NSIMPLE_EMERGENCY samg1_get_nsimple_emergency
#define SAMG1_SET_NSOLVE_DEFAULT samg1_set_nsolve_default
#define SAMG1_GET_NSOLVE_DEFAULT samg1_get_nsolve_default
#define SAMG1_SET_NSOLVE_2ND samg1_set_nsolve_2nd
#define SAMG1_GET_NSOLVE_2ND samg1_get_nsolve_2nd
#define SAMG1_SET_NSOLVE_UZAWA samg1_set_nsolve_uzawa
#define SAMG1_GET_NSOLVE_UZAWA samg1_get_nsolve_uzawa
#define SAMG1_SET_NSTAR_TYP samg1_set_nstar_typ
#define SAMG1_GET_NSTAR_TYP samg1_get_nstar_typ
#define SAMG1_SET_NSW_OMEGA_UZAWA samg1_set_nsw_omega_uzawa
#define SAMG1_GET_NSW_OMEGA_UZAWA samg1_get_nsw_omega_uzawa
#define SAMG1_SET_NSW_UZAWA samg1_set_nsw_uzawa
#define SAMG1_GET_NSW_UZAWA samg1_get_nsw_uzawa
#define SAMG1_SET_NTAKE_RES_IN samg1_set_ntake_res_in
#define SAMG1_GET_NTAKE_RES_IN samg1_get_ntake_res_in
#define SAMG1_SET_NTH_RES_SCRATCH samg1_set_nth_res_scratch
#define SAMG1_GET_NTH_RES_SCRATCH samg1_get_nth_res_scratch
#define SAMG1_SET_NTR samg1_set_ntr
#define SAMG1_GET_NTR samg1_get_ntr
#define SAMG1_SET_NTR_PRIM samg1_set_ntr_prim
#define SAMG1_GET_NTR_PRIM samg1_get_ntr_prim
#define SAMG1_SET_NTYP_ACCEL samg1_set_ntyp_accel
#define SAMG1_GET_NTYP_ACCEL samg1_get_ntyp_accel
#define SAMG1_SET_NTYP_GALERKIN samg1_set_ntyp_galerkin
#define SAMG1_GET_NTYP_GALERKIN samg1_get_ntyp_galerkin
#define SAMG1_SET_NUMTRY_MAX_SET samg1_set_numtry_max_set
#define SAMG1_GET_NUMTRY_MAX_SET samg1_get_numtry_max_set
#define SAMG1_SET_NVERSION samg1_set_nversion
#define SAMG1_GET_NVERSION samg1_get_nversion
#define SAMG1_SET_NWT samg1_set_nwt
#define SAMG1_GET_NWT samg1_get_nwt
#define SAMG1_SET_NXTYP_COARSE samg1_set_nxtyp_coarse
#define SAMG1_GET_NXTYP_COARSE samg1_get_nxtyp_coarse
#define SAMG1_SET_OIL_ACCEL samg1_set_oil_accel
#define SAMG1_GET_OIL_ACCEL samg1_get_oil_accel
#define SAMG1_SET_OIL_GPRS samg1_set_oil_gprs
#define SAMG1_GET_OIL_GPRS samg1_get_oil_gprs
#define SAMG1_SET_OIL_NOPRIM samg1_set_oil_noprim
#define SAMG1_GET_OIL_NOPRIM samg1_get_oil_noprim
#define SAMG1_SET_OMEGA_JAC_ES_UZAWA samg1_set_omega_jac_es_uzawa
#define SAMG1_GET_OMEGA_JAC_ES_UZAWA samg1_get_omega_jac_es_uzawa
#define SAMG1_SET_OMEGA_JAC_P_UZAWA samg1_set_omega_jac_p_uzawa
#define SAMG1_GET_OMEGA_JAC_P_UZAWA samg1_get_omega_jac_p_uzawa
#define SAMG1_SET_OMEGA_JACOBI samg1_set_omega_jacobi
#define SAMG1_GET_OMEGA_JACOBI samg1_get_omega_jacobi
#define SAMG1_SET_OMEGA_SOR_DO samg1_set_omega_sor_do
#define SAMG1_GET_OMEGA_SOR_DO samg1_get_omega_sor_do
#define SAMG1_SET_OMEGA_SOR_UP samg1_set_omega_sor_up
#define SAMG1_GET_OMEGA_SOR_UP samg1_get_omega_sor_up
#define SAMG1_SET_OMEGA_SMO samg1_set_omega_smo
#define SAMG1_GET_OMEGA_SMO samg1_get_omega_smo
#define SAMG1_SET_OMEGA_SMO_MIN samg1_set_omega_smo_min
#define SAMG1_GET_OMEGA_SMO_MIN samg1_get_omega_smo_min
#define SAMG1_SET_OMEGA_UZAWA samg1_set_omega_uzawa
#define SAMG1_GET_OMEGA_UZAWA samg1_get_omega_uzawa
#define SAMG1_SET_OMP_ILU samg1_set_omp_ilu
#define SAMG1_GET_OMP_ILU samg1_get_omp_ilu
#define SAMG1_ISET_OMP_PARTITION_FILE samg1_iset_omp_partition_file
#define SAMG1_IGET_OMP_PARTITION_FILE samg1_iget_omp_partition_file
#define SAMG1_SET_OMP_PARTITION_FILE samg1_set_omp_partition_file
#define SAMG1_GET_OMP_PARTITION_FILE samg1_get_omp_partition_file
#define SAMG1_SET_OMP_NUM_THREADS_EXTERNAL samg1_set_omp_num_threads_external
#define SAMG1_GET_OMP_NUM_THREADS_EXTERNAL samg1_get_omp_num_threads_external
#define SAMG1_SET_OMP_NTHREADS_ONLY4SPLIT samg1_set_omp_nthreads_only4split
#define SAMG1_GET_OMP_NTHREADS_ONLY4SPLIT samg1_get_omp_nthreads_only4split
#define SAMG1_SET_OMP_UZAWA samg1_set_omp_uzawa
#define SAMG1_GET_OMP_UZAWA samg1_get_omp_uzawa
#define SAMG1_SET_OPT_MATRIX_OPS samg1_set_opt_matrix_ops
#define SAMG1_GET_OPT_MATRIX_OPS samg1_get_opt_matrix_ops
#define SAMG1_SET_P_CMPLX_AGG_DEFAULT samg1_set_p_cmplx_agg_default
#define SAMG1_GET_P_CMPLX_AGG_DEFAULT samg1_get_p_cmplx_agg_default
#define SAMG1_SET_P_CMPLX_DEFAULT samg1_set_p_cmplx_default
#define SAMG1_GET_P_CMPLX_DEFAULT samg1_get_p_cmplx_default
#define SAMG1_SET_PARTIAL_FRAC samg1_set_partial_frac
#define SAMG1_GET_PARTIAL_FRAC samg1_get_partial_frac
#define SAMG1_ISET_PARTITION_FILE samg1_iset_partition_file
#define SAMG1_IGET_PARTITION_FILE samg1_iget_partition_file
#define SAMG1_SET_PARTITION_FILE samg1_set_partition_file
#define SAMG1_GET_PARTITION_FILE samg1_get_partition_file
#define SAMG1_SET_AMG_RENUMBER samg1_set_amg_renumber
#define SAMG1_GET_AMG_RENUMBER samg1_get_amg_renumber
#define SAMG1_ISET_AMG_RENUMBER_FILE samg1_iset_amg_renumber_file
#define SAMG1_IGET_AMG_RENUMBER_FILE samg1_iget_amg_renumber_file
#define SAMG1_SET_AMG_RENUMBER_FILE samg1_set_amg_renumber_file
#define SAMG1_GET_AMG_RENUMBER_FILE samg1_get_amg_renumber_file
#define SAMG1_ISET_DUMPFILE_RENUMBER samg1_iset_dumpfile_renumber
#define SAMG1_IGET_DUMPFILE_RENUMBER samg1_iget_dumpfile_renumber
#define SAMG1_SET_DUMPFILE_RENUMBER samg1_set_dumpfile_renumber
#define SAMG1_GET_DUMPFILE_RENUMBER samg1_get_dumpfile_renumber
#define SAMG1_SET_PERF_METER_ENABLED samg1_set_perf_meter_enabled
#define SAMG1_GET_PERF_METER_ENABLED samg1_get_perf_meter_enabled
#define SAMG1_SET_PRIM_NORM samg1_set_prim_norm
#define SAMG1_GET_PRIM_NORM samg1_get_prim_norm
#define SAMG1_SET_PRIM_PRINT samg1_set_prim_print
#define SAMG1_GET_PRIM_PRINT samg1_get_prim_print
#define SAMG1_SET_PRINT_NXTYP_COARSE_MSG samg1_set_print_nxtyp_coarse_msg
#define SAMG1_GET_PRINT_NXTYP_COARSE_MSG samg1_get_print_nxtyp_coarse_msg
#define SAMG1_SET_PRINT_SETUP_ILU_OR_DIRECT samg1_set_print_setup_ilu_or_direct
#define SAMG1_GET_PRINT_SETUP_ILU_OR_DIRECT samg1_get_print_setup_ilu_or_direct
#define SAMG1_SET_PRNT_STAT_SCHWARZ samg1_set_prnt_stat_schwarz
#define SAMG1_GET_PRNT_STAT_SCHWARZ samg1_get_prnt_stat_schwarz
#define SAMG1_SET_QUASI_ONLY samg1_set_quasi_only
#define SAMG1_GET_QUASI_ONLY samg1_get_quasi_only
#define SAMG1_SET_REDUCT_KCYCLE samg1_set_reduct_kcycle
#define SAMG1_GET_REDUCT_KCYCLE samg1_get_reduct_kcycle
#define SAMG1_SET_RBM_INTERN_INFO samg1_set_rbm_intern_info
#define SAMG1_GET_RBM_INTERN_INFO samg1_get_rbm_intern_info
#define SAMG1_SET_RCONDX samg1_set_rcondx
#define SAMG1_GET_RCONDX samg1_get_rcondx
#define SAMG1_SET_READ_UZAWA_PARMS samg1_set_read_uzawa_parms
#define SAMG1_GET_READ_UZAWA_PARMS samg1_get_read_uzawa_parms
#define SAMG1_SET_READ_MARIAN_COARSENING samg1_set_read_marian_coarsening
#define SAMG1_GET_READ_MARIAN_COARSENING samg1_get_read_marian_coarsening
#define SAMG1_SET_REFRESH_CALLED samg1_set_refresh_called
#define SAMG1_GET_REFRESH_CALLED samg1_get_refresh_called
#define SAMG1_SET_REL_APP_VAR samg1_set_rel_app_var
#define SAMG1_GET_REL_APP_VAR samg1_get_rel_app_var
#define SAMG1_SET_RHO_MIN samg1_set_rho_min
#define SAMG1_GET_RHO_MIN samg1_get_rho_min
#define SAMG1_SET_RHO_OK samg1_set_rho_ok
#define SAMG1_GET_RHO_OK samg1_get_rho_ok
#define SAMG1_SET_SHOW_UN_RES samg1_set_show_un_res
#define SAMG1_GET_SHOW_UN_RES samg1_get_show_un_res
#define SAMG1_ISET_SCRATCHFILE samg1_iset_scratchfile
#define SAMG1_IGET_SCRATCHFILE samg1_iget_scratchfile
#define SAMG1_SET_SCRATCHFILE samg1_set_scratchfile
#define SAMG1_GET_SCRATCHFILE samg1_get_scratchfile
#define SAMG1_SET_SLOW_COARSENING samg1_set_slow_coarsening
#define SAMG1_GET_SLOW_COARSENING samg1_get_slow_coarsening
#define SAMG1_SET_STABILITY samg1_set_stability
#define SAMG1_GET_STABILITY samg1_get_stability
#define SAMG1_SET_STRUCT_IDENT samg1_set_struct_ident
#define SAMG1_GET_STRUCT_IDENT samg1_get_struct_ident
#define SAMG1_SET_STRUCT_SYMM samg1_set_struct_symm
#define SAMG1_GET_STRUCT_SYMM samg1_get_struct_symm
#define SAMG1_SET_TAU_UZAWA samg1_set_tau_uzawa
#define SAMG1_GET_TAU_UZAWA samg1_get_tau_uzawa
#define SAMG1_SET_TERM_COARSENING samg1_set_term_coarsening
#define SAMG1_GET_TERM_COARSENING samg1_get_term_coarsening
#define SAMG1_SET_TRACE_L2_QUASI_RES samg1_set_trace_l2_quasi_res
#define SAMG1_GET_TRACE_L2_QUASI_RES samg1_get_trace_l2_quasi_res
#define SAMG1_SET_TRACKMEM samg1_set_trackmem
#define SAMG1_GET_TRACKMEM samg1_get_trackmem
#define SAMG1_SET_TRACKRESID samg1_set_trackresid
#define SAMG1_GET_TRACKRESID samg1_get_trackresid
#define SAMG1_SET_TRACK_AP_P samg1_set_track_ap_p
#define SAMG1_GET_TRACK_AP_P samg1_get_track_ap_p
#define SAMG1_SET_USE_IC samg1_set_use_ic
#define SAMG1_GET_USE_IC samg1_get_use_ic
#define SAMG1_SET_VIO_DD samg1_set_vio_dd
#define SAMG1_GET_VIO_DD samg1_get_vio_dd
#define SAMG1_SET_W_AVRGE_AGG_DEFAULT samg1_set_w_avrge_agg_default
#define SAMG1_GET_W_AVRGE_AGG_DEFAULT samg1_get_w_avrge_agg_default
#define SAMG1_SET_W_AVRGE_DEFAULT samg1_set_w_avrge_default
#define SAMG1_GET_W_AVRGE_DEFAULT samg1_get_w_avrge_default
#define SAMG1_SET_WCOUPLED samg1_set_wcoupled
#define SAMG1_GET_WCOUPLED samg1_get_wcoupled
#define SAMG1_SET_WFT samg1_set_wft
#define SAMG1_GET_WFT samg1_get_wft
#define SAMG1_SET_WLEN_SWITCHES_GALERKIN samg1_set_wlen_switches_galerkin
#define SAMG1_GET_WLEN_SWITCHES_GALERKIN samg1_get_wlen_switches_galerkin
#define SAMG1_SET_WRITE_CLUSTER_ID samg1_set_write_cluster_id
#define SAMG1_GET_WRITE_CLUSTER_ID samg1_get_write_cluster_id
#define SAMG1_SET_WTSL samg1_set_wtsl
#define SAMG1_GET_WTSL samg1_get_wtsl
#define SAMG1_RELEASE_INFO samg1_release_info
#define SAMG1_VERSION_INFO samg1_version_info
#define SAMG1_DETAILS_INFO samg1_details_info
#endif

