openCSMP/openCSMP/lib/samg/samg1.h
#ifdef SAMG_LCASE_USCORE
#define SAMG1 samg1_
#define SAMG1_CTIME samg1_ctime_
#define SAMG1_CPUTIME samg1_cputime_
#define SAMG1_ELAPSED_TIME samg1_elapsed_time_
#define SAMG1_ALL_ERRORINFO samg1_all_errorinfo_
#define SAMG1_SIMPLE samg1_simple_
#define SAMG1_MAIN samg1_main_
#define SAMG1_LEAVE samg1_leave_
#define SAMG1_REFRESH samg1_refresh_
#define SAMG1_CLEANUP samg1_cleanup_
#define SAMG1_RESET_HIDDEN samg1_reset_hidden_
#define SAMG1_GET_COMPLEXITIES samg1_get_complexities_
#define SAMG1_GET_NFLAG samg1_get_nflag_
#define SAMG1_SET_NFLAG samg1_set_nflag_
#define SAMG1_GET_NFLAGO samg1_get_nflago_
#define SAMG1_SET_NFLAGO samg1_set_nflago_
#define SAMG1_GET_NFLAGP samg1_get_nflagp_
#define SAMG1_SET_NFLAGP samg1_set_nflagp_
#define SAMG1_GET_NFLAGS samg1_get_nflags_
#define SAMG1_SET_NFLAGS samg1_set_nflags_
#define SAMG1_GET_LEVELS_CREATED samg1_get_levels_created_
#define SAMG1_GET_LEVELS_USED samg1_get_levels_used_
#define SAMG1_GET_LEV_SIZES samg1_get_lev_sizes_
#define SAMG1_GET_MEM_ACTIVE samg1_get_mem_active_
#define SAMG1_GET_TIME_AND_MEM samg1_get_time_and_mem_
#define SAMG1_EXTRAPRINT samg1_extraprint_
#define SAMG1_FLUSH samg1_flush_
#define SAMG1_CVEC_ALLOC samg1_cvec_alloc_
#define SAMG1_CVEC_DEALLOC samg1_cvec_dealloc_
#define SAMG1_CVEC_SET samg1_cvec_set_
#define SAMG1_CVEC_GET samg1_cvec_get_
#define SAMG1_PROPOSE_NSYS_ISCALE_IU samg1_propose_nsys_iscale_iu_
#define SAMG1_USED_OMP_THREADS samg1_used_omp_threads_
#define SAMG1_GET_INNERMAX samg1_get_innermax_
#define SAMG1_SET_INNERMAX samg1_set_innermax_
#define SAMG1_DRV_SET_INNERMAX samg1_drv1_set_innermax_
#define SAMG1_GET_NUM_SMOOTH_VECTORS samg1_get_num_smooth_vectors_
#define SAMG1_SMOOTH_VECTOR_INIT samg1_smooth_vector_init_
#define SAMG1_SMOOTH_VECTOR_SET samg1_smooth_vector_set_
#define SAMG1_SMOOTH_VECTOR_GET samg1_smooth_vector_get_
#define SAMG1_GET_NUM_DEFLATION_VECTORS samg1_get_num_deflation_vectors_
#define SAMG1_DEFLATION_VECTOR_INIT samg1_deflation_vector_init_
#define SAMG1_DEFLATION_VECTOR_SET samg1_deflation_vector_set_
#define SAMG1_DEFLATION_VECTOR_GET samg1_deflation_vector_get_
#define SAMG1_USER_CHECK samg1_user_check_
#define SAMG1_USER_SOLVE samg1_user_solve_
#define SAMG1_USER_CLEANUP samg1_user_cleanup_
#define SAMG1_ARRAY_OFFSET samg1_array_offset_
#define SAMG1_PERFINIT samg1_perfinit_
#define SAMG1_PERFOUT samg1_perfout_
#define SAMG1_PARALLEL_LIB samg1_parallel_lib_
#define SAMG1_MEM_INFO samg1_mem_info_
#define SAMG1_LRATIO samg1_lratio_
#define SAMG1_ADDTIME samg1_addtime_
#define SAMG1_COMPTIME samg1_comptime_
#define SAMG1_COPY_GALERKIN samg1_copy_galerkin_
#define SAMG1_OMEGA_JACOBI_ALLOC samg1_omega_jacobi_alloc_
#define SAMG1_OMEGA_JACOBI_DEALLOC samg1_omega_jacobi_dealloc_
#define SAMG1_OMEGA_JACOBI_SET samg1_omega_jacobi_set_
#define SAMG1_CURRENT_RESIDUAL samg1_current_residual_
#define SAMG1_OPEN_LOGFILE samg1_open_logfile_
#define SAMG1_CLOSE_LOGFILE samg1_close_logfile_
#define SAMG1_COO_VEC_SET samg1_coo_vec_set_
#define SAMG1_COO_VEC_ALLOC samg1_coo_vec_alloc_
#define SAMG1_COO_VEC_DEALLOC samg1_coo_vec_dealloc_
#define SAMG1_IDEC samg1_idec_
#define SAMG1_DC samg1_dc_
#define XSAMG1 xsamg1_
#define XSAMG1_DC xsamg1_dc_
#define XSAMG1_START xsamg1_start_
#define XSAMG1_START_LINUX xsamg1_start_linux_
#define XSAMG1_USER_CTRL xsamg1_user_ctrl_
#define XSAMG1_START_IUM xsamg1_start_ium_
#define XSAMG1_START_SOLVER xsamg1_start_solver_
#define XSAMG1_END_SOLVER xsamg1_end_solver_
#define XSAMG1_FINALIZE xsamg1_finalize_
#define XSAMG1_END xsamg1_end_
#define XSAMG1_GET_LOGIO xsamg1_get_logio_
#define XSAMG1_GET_SLAVE_RETURNCODE xsamg1_get_slave_returncode_
#define XSAMG1_PROCESS_INFO xsamg1_process_info_
#define XSAMG1_GET_INTERNAL_TIMER xsamg1_get_internal_timer_
#define XSAMG1_MPI_INIT xsamg1_mpi_init_
#define XSAMG1_MPI_FINALIZE xsamg1_mpi_finalize_
#define XSAMG1_MPI_COMM_RANK xsamg1_mpi_comm_rank_
#define XSAMG1_GET_MPI_COMM_WORLD xsamg1_get_mpi_comm_world_
#define XSAMG1_GET_PARALLEL_RUN xsamg1_get_parallel_run_
#define XSAMG1_IO_SETTINGS xsamg1_io_settings_
#define XSAMG1_IO_SETTINGS2 xsamg1_io_settings2_
#define XSAMG1_LAST_MSG xsamg1_last_msg_
#define XSAMG1_READ_CONFIG xsamg1_read_config_
#define XSAMG1_PRINT_INTERNAL_TIMER xsamg1_print_internal_timer_
#define XSAMG1_ERROR_INFO xsamg1_error_info_
#define XSAMG1_GET_IERR_ON_TAG_STOP xsamg1_get_ierr_on_tag_stop_
#define XSAMG1_CONFIGFILE_MISSING xsamg1_configfile_missing_
#define XSAMG1_LEAVE xsamg1_leave_
#define XSAMG1_CLEANUP xsamg1_cleanup_
#define SAMG1_DUMP_SEQUENCE_RESET samg1_dump_sequence_reset_
#define SAMG1_GET_RESIDUAL_VECTOR_E samg1_get_residual_vector_e_
#define SAMG1_GET_RESIDUAL_VECTOR_V samg1_get_residual_vector_v_
#define SAMG1_RESIDUAL_VECTOR_LEAVE samg1_residual_vector_leave_
#define SAMG1_SET_RESIDUAL_VECTOR_E samg1_set_residual_vector_e_
#define SAMG1_SET_RESIDUAL_VECTOR_V samg1_set_residual_vector_v_
#define SAMG1_SET_RESIDUAL_VECTOR_INIT samg1_set_residual_vector_init_
#define XSAMG1_OIL xsamg1_oil_
#define SAMG1_OIL samg1_oil_
#define SAMG1_SET_RENUMBER_VEC samg1_set_renumber_vec_
#define SAMG1_GET_RENUMBER_VEC samg1_get_renumber_vec_
#define SAMG1_GETRE_NU samg1_getre_nu_
#define SAMG1_GETDBLE_NU samg1_getdble_nu_
#define SAMG1_GETINT_NU samg1_getint_nu_
#define SAMG1_GETTE_NU samg1_gette_nu_
#define SAMG1_GETLO_NU samg1_getlo_nu_
#define SAMG1_GETSPEC_NU samg1_getspec_nu_
#define SAMG1_SET_A_CMPLX_AGG_DEFAULT samg1_set_a_cmplx_agg_default_
#define SAMG1_GET_A_CMPLX_AGG_DEFAULT samg1_get_a_cmplx_agg_default_
#define SAMG1_SET_A_CMPLX_DEFAULT samg1_set_a_cmplx_default_
#define SAMG1_GET_A_CMPLX_DEFAULT samg1_get_a_cmplx_default_
#define SAMG1_SET_ALLOW_FILNAM_IN samg1_set_allow_filnam_in_
#define SAMG1_GET_ALLOW_FILNAM_IN samg1_get_allow_filnam_in_
#define SAMG1_SET_ALLOW_PRIVATE_IN samg1_set_allow_private_in_
#define SAMG1_GET_ALLOW_PRIVATE_IN samg1_get_allow_private_in_
#define SAMG1_SET_ALLOW_ELIM samg1_set_allow_elim_
#define SAMG1_GET_ALLOW_ELIM samg1_get_allow_elim_
#define SAMG1_SET_ALLUNS_AT_ALLPNTS samg1_set_alluns_at_allpnts_
#define SAMG1_GET_ALLUNS_AT_ALLPNTS samg1_get_alluns_at_allpnts_
#define SAMG1_SET_ART_TIME samg1_set_art_time_
#define SAMG1_GET_ART_TIME samg1_get_art_time_
#define SAMG1_SET_ART_TIME_CYC samg1_set_art_time_cyc_
#define SAMG1_GET_ART_TIME_CYC samg1_get_art_time_cyc_
#define SAMG1_SET_ART_TIME_CYC_2ND samg1_set_art_time_cyc_2nd_
#define SAMG1_GET_ART_TIME_CYC_2ND samg1_get_art_time_cyc_2nd_
#define SAMG1_SET_ART_TIME_SETUP samg1_set_art_time_setup_
#define SAMG1_GET_ART_TIME_SETUP samg1_get_art_time_setup_
#define SAMG1_SET_ART_TIME_SETUP_2ND samg1_set_art_time_setup_2nd_
#define SAMG1_GET_ART_TIME_SETUP_2ND samg1_get_art_time_setup_2nd_
#define SAMG1_SET_B_CMPLX samg1_set_b_cmplx_
#define SAMG1_GET_B_CMPLX samg1_get_b_cmplx_
#define SAMG1_SET_B_CMPLX_AGG_DEFAULT samg1_set_b_cmplx_agg_default_
#define SAMG1_GET_B_CMPLX_AGG_DEFAULT samg1_get_b_cmplx_agg_default_
#define SAMG1_SET_B_CMPLX_DEFAULT samg1_set_b_cmplx_default_
#define SAMG1_GET_B_CMPLX_DEFAULT samg1_get_b_cmplx_default_
#define SAMG1_SET_BACKUP samg1_set_backup_
#define SAMG1_GET_BACKUP samg1_get_backup_
#define SAMG1_SET_BLK_FILLEXP samg1_set_blk_fillexp_
#define SAMG1_GET_BLK_FILLEXP samg1_get_blk_fillexp_
#define SAMG1_SET_BLK_STAB samg1_set_blk_stab_
#define SAMG1_GET_BLK_STAB samg1_get_blk_stab_
#define SAMG1_SET_BLOCK_SCALE samg1_set_block_scale_
#define SAMG1_GET_BLOCK_SCALE samg1_get_block_scale_
#define SAMG1_SET_BLOCK_SCALE2 samg1_set_block_scale2_
#define SAMG1_GET_BLOCK_SCALE2 samg1_get_block_scale2_
#define SAMG1_SET_BLOCK_SCALE3 samg1_set_block_scale3_
#define SAMG1_GET_BLOCK_SCALE3 samg1_get_block_scale3_
#define SAMG1_SET_BS_AUTO_SIGN samg1_set_bs_auto_sign_
#define SAMG1_GET_BS_AUTO_SIGN samg1_get_bs_auto_sign_
#define SAMG1_SET_BS_MIN_BLOCK_SIZE samg1_set_bs_min_block_size_
#define SAMG1_GET_BS_MIN_BLOCK_SIZE samg1_get_bs_min_block_size_
#define SAMG1_SET_BS_OMP samg1_set_bs_omp_
#define SAMG1_GET_BS_OMP samg1_get_bs_omp_
#define SAMG1_ISET_BND_PARTITION_FILE samg1_iset_bnd_partition_file_
#define SAMG1_IGET_BND_PARTITION_FILE samg1_iget_bnd_partition_file_
#define SAMG1_SET_BND_PARTITION_FILE samg1_set_bnd_partition_file_
#define SAMG1_GET_BND_PARTITION_FILE samg1_get_bnd_partition_file_
#define SAMG1_SET_CHECK_ALLPNTS samg1_set_check_allpnts_
#define SAMG1_GET_CHECK_ALLPNTS samg1_get_check_allpnts_
#define SAMG1_SET_CHECK_ORDER samg1_set_check_order_
#define SAMG1_GET_CHECK_ORDER samg1_get_check_order_
#define SAMG1_SET_CHECK_BCSR_DUMP samg1_set_check_bcsr_dump_
#define SAMG1_GET_CHECK_BCSR_DUMP samg1_get_check_bcsr_dump_
#define SAMG1_SET_CL_CPL samg1_set_cl_cpl_
#define SAMG1_GET_CL_CPL samg1_get_cl_cpl_
#define SAMG1_SET_CL_ORDER samg1_set_cl_order_
#define SAMG1_GET_CL_ORDER samg1_get_cl_order_
#define SAMG1_SET_CL_OUTRES samg1_set_cl_outres_
#define SAMG1_GET_CL_OUTRES samg1_get_cl_outres_
#define SAMG1_SET_CL_LEVEL_DEP samg1_set_cl_level_dep_
#define SAMG1_GET_CL_LEVEL_DEP samg1_get_cl_level_dep_
#define SAMG1_SET_CL_AUTO_SIZE samg1_set_cl_auto_size_
#define SAMG1_GET_CL_AUTO_SIZE samg1_get_cl_auto_size_
#define SAMG1_SET_CL_PROC_BORDER samg1_set_cl_proc_border_
#define SAMG1_GET_CL_PROC_BORDER samg1_get_cl_proc_border_
#define SAMG1_SET_CL_QUALITY_MEASURE samg1_set_cl_quality_measure_
#define SAMG1_GET_CL_QUALITY_MEASURE samg1_get_cl_quality_measure_
#define SAMG1_SET_CL_GLOBAL_QUALITY samg1_set_cl_global_quality_
#define SAMG1_GET_CL_GLOBAL_QUALITY samg1_get_cl_global_quality_
#define SAMG1_SET_CL_OMP samg1_set_cl_omp_
#define SAMG1_GET_CL_OMP samg1_get_cl_omp_
#define SAMG1_SET_CL_CMK_REORDER samg1_set_cl_cmk_reorder_
#define SAMG1_GET_CL_CMK_REORDER samg1_get_cl_cmk_reorder_
#define SAMG1_SET_CLSOLVER_FINEST samg1_set_clsolver_finest_
#define SAMG1_GET_CLSOLVER_FINEST samg1_get_clsolver_finest_
#define SAMG1_SET_CLDENSE_CTRL samg1_set_cldense_ctrl_
#define SAMG1_GET_CLDENSE_CTRL samg1_get_cldense_ctrl_
#define SAMG1_SET_CONST_INT_GLK samg1_set_const_int_glk_
#define SAMG1_GET_CONST_INT_GLK samg1_get_const_int_glk_
#define SAMG1_SET_CONST_INT_SOL samg1_set_const_int_sol_
#define SAMG1_GET_CONST_INT_SOL samg1_get_const_int_sol_
#define SAMG1_SET_CNTRL_ENFORCE samg1_set_cntrl_enforce_
#define SAMG1_GET_CNTRL_ENFORCE samg1_get_cntrl_enforce_
#define SAMG1_SET_CNTRL_LOGFILE samg1_set_cntrl_logfile_
#define SAMG1_GET_CNTRL_LOGFILE samg1_get_cntrl_logfile_
#define SAMG1_SET_CNTRL_METHOD samg1_set_cntrl_method_
#define SAMG1_GET_CNTRL_METHOD samg1_get_cntrl_method_
#define SAMG1_SET_CNTRL_RELEASE samg1_set_cntrl_release_
#define SAMG1_GET_CNTRL_RELEASE samg1_get_cntrl_release_
#define SAMG1_SET_CNTRL_RES_DIFF samg1_set_cntrl_res_diff_
#define SAMG1_GET_CNTRL_RES_DIFF samg1_get_cntrl_res_diff_
#define SAMG1_SET_CNTRL_RETRY_ITER samg1_set_cntrl_retry_iter_
#define SAMG1_GET_CNTRL_RETRY_ITER samg1_get_cntrl_retry_iter_
#define SAMG1_SET_CNTRL_STEADY samg1_set_cntrl_steady_
#define SAMG1_GET_CNTRL_STEADY samg1_get_cntrl_steady_
#define SAMG1_SET_CONV_STOP samg1_set_conv_stop_
#define SAMG1_GET_CONV_STOP samg1_get_conv_stop_
#define SAMG1_SET_CORRECT_CLUSTER_INFO samg1_set_correct_cluster_info_
#define SAMG1_GET_CORRECT_CLUSTER_INFO samg1_get_correct_cluster_info_
#define SAMG1_SET_CSET_LASTPNT samg1_set_cset_lastpnt_
#define SAMG1_GET_CSET_LASTPNT samg1_get_cset_lastpnt_
#define SAMG1_SET_CSET_LESSVARS samg1_set_cset_lessvars_
#define SAMG1_GET_CSET_LESSVARS samg1_get_cset_lessvars_
#define SAMG1_SET_CSET_LONGROW samg1_set_cset_longrow_
#define SAMG1_GET_CSET_LONGROW samg1_get_cset_longrow_
#define SAMG1_ISET_CSET_READ samg1_iset_cset_read_
#define SAMG1_IGET_CSET_READ samg1_iget_cset_read_
#define SAMG1_SET_CSET_READ samg1_set_cset_read_
#define SAMG1_GET_CSET_READ samg1_get_cset_read_
#define SAMG1_SET_CSET_ZERODIAG samg1_set_cset_zerodiag_
#define SAMG1_GET_CSET_ZERODIAG samg1_get_cset_zerodiag_
#define SAMG1_SET_CSET_UNKNOWN samg1_set_cset_unknown_
#define SAMG1_GET_CSET_UNKNOWN samg1_get_cset_unknown_
#define SAMG1_SET_CSET_UNKNOWN1 samg1_set_cset_unknown1_
#define SAMG1_GET_CSET_UNKNOWN1 samg1_get_cset_unknown1_
#define SAMG1_SET_CSET_UNKNOWN2 samg1_set_cset_unknown2_
#define SAMG1_GET_CSET_UNKNOWN2 samg1_get_cset_unknown2_
#define SAMG1_SET_DELTA_MILU samg1_set_delta_milu_
#define SAMG1_GET_DELTA_MILU samg1_get_delta_milu_
#define SAMG1_SET_DENSX samg1_set_densx_
#define SAMG1_GET_DENSX samg1_get_densx_
#define SAMG1_SET_DIVERGENCE samg1_set_divergence_
#define SAMG1_GET_DIVERGENCE samg1_get_divergence_
#define SAMG1_SET_DIV_STOP_RULE samg1_set_div_stop_rule_
#define SAMG1_GET_DIV_STOP_RULE samg1_get_div_stop_rule_
#define SAMG1_SET_DIV_THRESHOLD samg1_set_div_threshold_
#define SAMG1_GET_DIV_THRESHOLD samg1_get_div_threshold_
#define SAMG1_SET_DROPTOL samg1_set_droptol_
#define SAMG1_GET_DROPTOL samg1_get_droptol_
#define SAMG1_SET_DROPTOL_CL samg1_set_droptol_cl_
#define SAMG1_GET_DROPTOL_CL samg1_get_droptol_cl_
#define SAMG1_SET_DROPTOL_2ND samg1_set_droptol_2nd_
#define SAMG1_GET_DROPTOL_2ND samg1_get_droptol_2nd_
#define SAMG1_SET_DROPTOL_SMO samg1_set_droptol_smo_
#define SAMG1_GET_DROPTOL_SMO samg1_get_droptol_smo_
#define SAMG1_SET_DUMP_APPROX_SOLUTION samg1_set_dump_approx_solution_
#define SAMG1_GET_DUMP_APPROX_SOLUTION samg1_get_dump_approx_solution_
#define SAMG1_SET_DUMP_CORRECTW samg1_set_dump_correctw_
#define SAMG1_GET_DUMP_CORRECTW samg1_get_dump_correctw_
#define SAMG1_SET_DUMP_GENERATED_SMOVEC samg1_set_dump_generated_smovec_
#define SAMG1_GET_DUMP_GENERATED_SMOVEC samg1_get_dump_generated_smovec_
#define SAMG1_SET_ECG samg1_set_ecg_
#define SAMG1_GET_ECG samg1_get_ecg_
#define SAMG1_SET_ECG_DEFAULT samg1_set_ecg_default_
#define SAMG1_GET_ECG_DEFAULT samg1_get_ecg_default_
#define SAMG1_SET_ICHOLESKY samg1_set_icholesky_
#define SAMG1_GET_ICHOLESKY samg1_get_icholesky_
#define SAMG1_SET_ENFORCE_FULLSMO samg1_set_enforce_fullsmo_
#define SAMG1_GET_ENFORCE_FULLSMO samg1_get_enforce_fullsmo_
#define SAMG1_SET_EPS_ABS samg1_set_eps_abs_
#define SAMG1_GET_EPS_ABS samg1_get_eps_abs_
#define SAMG1_SET_EPS_ACCEPT_JAC_UZAWA samg1_set_eps_accept_jac_uzawa_
#define SAMG1_GET_EPS_ACCEPT_JAC_UZAWA samg1_get_eps_accept_jac_uzawa_
#define SAMG1_SET_EPS_CONVERG_JAC_UZAWA samg1_set_eps_converg_jac_uzawa_
#define SAMG1_GET_EPS_CONVERG_JAC_UZAWA samg1_get_eps_converg_jac_uzawa_
#define SAMG1_SET_EPS_DD samg1_set_eps_dd_
#define SAMG1_GET_EPS_DD samg1_get_eps_dd_
#define SAMG1_SET_EPS_DIVERG_JAC_UZAWA samg1_set_eps_diverg_jac_uzawa_
#define SAMG1_GET_EPS_DIVERG_JAC_UZAWA samg1_get_eps_diverg_jac_uzawa_
#define SAMG1_SET_EPS_DIAG samg1_set_eps_diag_
#define SAMG1_GET_EPS_DIAG samg1_get_eps_diag_
#define SAMG1_SET_EPS_LSQ samg1_set_eps_lsq_
#define SAMG1_GET_EPS_LSQ samg1_get_eps_lsq_
#define SAMG1_SET_ETR samg1_set_etr_
#define SAMG1_GET_ETR samg1_get_etr_
#define SAMG1_SET_ETR_DEFAULT samg1_set_etr_default_
#define SAMG1_GET_ETR_DEFAULT samg1_get_etr_default_
#define SAMG1_SET_ETR2_SMO samg1_set_etr2_smo_
#define SAMG1_GET_ETR2_SMO samg1_get_etr2_smo_
#define SAMG1_SET_EWT samg1_set_ewt_
#define SAMG1_GET_EWT samg1_get_ewt_
#define SAMG1_SET_EWT_DEFAULT samg1_set_ewt_default_
#define SAMG1_GET_EWT_DEFAULT samg1_get_ewt_default_
#define SAMG1_SET_FACTOR_APP_VAR samg1_set_factor_app_var_
#define SAMG1_GET_FACTOR_APP_VAR samg1_get_factor_app_var_
#define SAMG1_SET_FACTOR_QUASI_RES samg1_set_factor_quasi_res_
#define SAMG1_GET_FACTOR_QUASI_RES samg1_get_factor_quasi_res_
#define SAMG1_SET_FACTOR_RES_VAR samg1_set_factor_res_var_
#define SAMG1_GET_FACTOR_RES_VAR samg1_get_factor_res_var_
#define SAMG1_SET_FACTOR_MATRIX_SCALE samg1_set_factor_matrix_scale_
#define SAMG1_GET_FACTOR_MATRIX_SCALE samg1_get_factor_matrix_scale_
#define SAMG1_SET_FACTOR_SOL_JAC_UZAWA samg1_set_factor_sol_jac_uzawa_
#define SAMG1_GET_FACTOR_SOL_JAC_UZAWA samg1_get_factor_sol_jac_uzawa_
#define SAMG1_ISET_FILNAM samg1_iset_filnam_
#define SAMG1_IGET_FILNAM samg1_iget_filnam_
#define SAMG1_SET_FILNAM samg1_set_filnam_
#define SAMG1_GET_FILNAM samg1_get_filnam_
#define SAMG1_ISET_FILNAM_DUMPSOL samg1_iset_filnam_dumpsol_
#define SAMG1_IGET_FILNAM_DUMPSOL samg1_iget_filnam_dumpsol_
#define SAMG1_SET_FILNAM_DUMPSOL samg1_set_filnam_dumpsol_
#define SAMG1_GET_FILNAM_DUMPSOL samg1_get_filnam_dumpsol_
#define SAMG1_ISET_FILNAM_DUMP samg1_iset_filnam_dump_
#define SAMG1_IGET_FILNAM_DUMP samg1_iget_filnam_dump_
#define SAMG1_SET_FILNAM_DUMP samg1_set_filnam_dump_
#define SAMG1_GET_FILNAM_DUMP samg1_get_filnam_dump_
#define SAMG1_ISET_FILNAM_UZAWA samg1_iset_filnam_uzawa_
#define SAMG1_IGET_FILNAM_UZAWA samg1_iget_filnam_uzawa_
#define SAMG1_SET_FILNAM_UZAWA samg1_set_filnam_uzawa_
#define SAMG1_GET_FILNAM_UZAWA samg1_get_filnam_uzawa_
#define SAMG1_SET_FLEX_PCG_LITE samg1_set_flex_pcg_lite_
#define SAMG1_GET_FLEX_PCG_LITE samg1_get_flex_pcg_lite_
#define SAMG1_SET_FORCE_ACCEL samg1_set_force_accel_
#define SAMG1_GET_FORCE_ACCEL samg1_get_force_accel_
#define SAMG1_SET_FORCE_ACCEL_2ND samg1_set_force_accel_2nd_
#define SAMG1_GET_FORCE_ACCEL_2ND samg1_get_force_accel_2nd_
#define SAMG1_SET_FULL_PIVOTING samg1_set_full_pivoting_
#define SAMG1_GET_FULL_PIVOTING samg1_get_full_pivoting_
#define SAMG1_SET_FULL_SETUP samg1_set_full_setup_
#define SAMG1_GET_FULL_SETUP samg1_get_full_setup_
#define SAMG1_SET_G_CMPLX_AGG_DEFAULT samg1_set_g_cmplx_agg_default_
#define SAMG1_GET_G_CMPLX_AGG_DEFAULT samg1_get_g_cmplx_agg_default_
#define SAMG1_SET_G_CMPLX_DEFAULT samg1_set_g_cmplx_default_
#define SAMG1_GET_G_CMPLX_DEFAULT samg1_get_g_cmplx_default_
#define SAMG1_SET_GALERKIN_TIMER samg1_set_galerkin_timer_
#define SAMG1_GET_GALERKIN_TIMER samg1_get_galerkin_timer_
#define SAMG1_SET_GLK_MULT_ZEROS samg1_set_glk_mult_zeros_
#define SAMG1_GET_GLK_MULT_ZEROS samg1_get_glk_mult_zeros_
#define SAMG1_SET_GMAX_MULTIPASS samg1_set_gmax_multipass_
#define SAMG1_GET_GMAX_MULTIPASS samg1_get_gmax_multipass_
#define SAMG1_SET_IAGGREGATION_PROFILE samg1_set_iaggregation_profile_
#define SAMG1_GET_IAGGREGATION_PROFILE samg1_get_iaggregation_profile_
#define SAMG1_SET_IAGGREGATION samg1_set_iaggregation_
#define SAMG1_GET_IAGGREGATION samg1_get_iaggregation_
#define SAMG1_SET_IALL_SMO samg1_set_iall_smo_
#define SAMG1_GET_IALL_SMO samg1_get_iall_smo_
#define SAMG1_SET_IAUTO_OMEGA_JACOBI samg1_set_iauto_omega_jacobi_
#define SAMG1_GET_IAUTO_OMEGA_JACOBI samg1_get_iauto_omega_jacobi_
#define SAMG1_SET_IAUTO_OMEGA_SMOAGG samg1_set_iauto_omega_smoagg_
#define SAMG1_GET_IAUTO_OMEGA_SMOAGG samg1_get_iauto_omega_smoagg_
#define SAMG1_SET_IAUTO_STOP samg1_set_iauto_stop_
#define SAMG1_GET_IAUTO_STOP samg1_get_iauto_stop_
#define SAMG1_SET_IDUMP_SEQUENCE_START samg1_set_idump_sequence_start_
#define SAMG1_GET_IDUMP_SEQUENCE_START samg1_get_idump_sequence_start_
#define SAMG1_SET_IDUMP_SEQUENCE_END samg1_set_idump_sequence_end_
#define SAMG1_GET_IDUMP_SEQUENCE_END samg1_get_idump_sequence_end_
#define SAMG1_SET_ISTAB_CG samg1_set_istab_cg_
#define SAMG1_GET_ISTAB_CG samg1_get_istab_cg_
#define SAMG1_SET_IELASTICITY_PROFILE samg1_set_ielasticity_profile_
#define SAMG1_GET_IELASTICITY_PROFILE samg1_get_ielasticity_profile_
#define SAMG1_SET_IELASTICITY samg1_set_ielasticity_
#define SAMG1_GET_IELASTICITY samg1_get_ielasticity_
#define SAMG1_SET_IESTIM_SPECT_RADIUS samg1_set_iestim_spect_radius_
#define SAMG1_GET_IESTIM_SPECT_RADIUS samg1_get_iestim_spect_radius_
#define SAMG1_SET_IESTIM_SMOOTH_NIT samg1_set_iestim_smooth_nit_
#define SAMG1_GET_IESTIM_SMOOTH_NIT samg1_get_iestim_smooth_nit_
#define SAMG1_SET_INIT_RES_TREATMENT samg1_set_init_res_treatment_
#define SAMG1_GET_INIT_RES_TREATMENT samg1_get_init_res_treatment_
#define SAMG1_SET_IPRNT_RES_ACCURACY samg1_set_iprnt_res_accuracy_
#define SAMG1_GET_IPRNT_RES_ACCURACY samg1_get_iprnt_res_accuracy_
#define SAMG1_SET_ISMO2DFL samg1_set_ismo2dfl_
#define SAMG1_GET_ISMO2DFL samg1_get_ismo2dfl_
#define SAMG1_SET_ISMOAGG_AGGRESSIVE samg1_set_ismoagg_aggressive_
#define SAMG1_GET_ISMOAGG_AGGRESSIVE samg1_get_ismoagg_aggressive_
#define SAMG1_SET_ISMOAGG_OVERCORRECTION samg1_set_ismoagg_overcorrection_
#define SAMG1_GET_ISMOAGG_OVERCORRECTION samg1_get_ismoagg_overcorrection_
#define SAMG1_SET_ISMOAGG_OPTIM samg1_set_ismoagg_optim_
#define SAMG1_GET_ISMOAGG_OPTIM samg1_get_ismoagg_optim_
#define SAMG1_SET_ISMOAGG_BLOCK_TYP samg1_set_ismoagg_block_typ_
#define SAMG1_GET_ISMOAGG_BLOCK_TYP samg1_get_ismoagg_block_typ_
#define SAMG1_SET_ISMOAGG_COMPRESSION samg1_set_ismoagg_compression_
#define SAMG1_GET_ISMOAGG_COMPRESSION samg1_get_ismoagg_compression_
#define SAMG1_SET_ISMOAGG_FILTER_TYP samg1_set_ismoagg_filter_typ_
#define SAMG1_GET_ISMOAGG_FILTER_TYP samg1_get_ismoagg_filter_typ_
#define SAMG1_SET_ISMOAGG_SMOOTH_TYP samg1_set_ismoagg_smooth_typ_
#define SAMG1_GET_ISMOAGG_SMOOTH_TYP samg1_get_ismoagg_smooth_typ_
#define SAMG1_SET_ISMOAGG_SMOOTH_NIT samg1_set_ismoagg_smooth_nit_
#define SAMG1_GET_ISMOAGG_SMOOTH_NIT samg1_get_ismoagg_smooth_nit_
#define SAMG1_SET_ISMOAGG_SMOOTH_1LEV samg1_set_ismoagg_smooth_1lev_
#define SAMG1_GET_ISMOAGG_SMOOTH_1LEV samg1_get_ismoagg_smooth_1lev_
#define SAMG1_SET_ISMOAGG_SMOOTH_NLEV samg1_set_ismoagg_smooth_nlev_
#define SAMG1_GET_ISMOAGG_SMOOTH_NLEV samg1_get_ismoagg_smooth_nlev_
#define SAMG1_SET_IB_CMPLX samg1_set_ib_cmplx_
#define SAMG1_GET_IB_CMPLX samg1_get_ib_cmplx_
#define SAMG1_SET_IB_CMPLX_AGG_DEFAULT samg1_set_ib_cmplx_agg_default_
#define SAMG1_GET_IB_CMPLX_AGG_DEFAULT samg1_get_ib_cmplx_agg_default_
#define SAMG1_SET_IB_CMPLX_DEFAULT samg1_set_ib_cmplx_default_
#define SAMG1_GET_IB_CMPLX_DEFAULT samg1_get_ib_cmplx_default_
#define SAMG1_SET_IBGS_PIVOT samg1_set_ibgs_pivot_
#define SAMG1_GET_IBGS_PIVOT samg1_get_ibgs_pivot_
#define SAMG1_SET_ICASE_JAC_UZAWA samg1_set_icase_jac_uzawa_
#define SAMG1_GET_ICASE_JAC_UZAWA samg1_get_icase_jac_uzawa_
#define SAMG1_SET_ISTATISTICS_SMOVEC samg1_set_istatistics_smovec_
#define SAMG1_GET_ISTATISTICS_SMOVEC samg1_get_istatistics_smovec_
#define SAMG1_SET_ICHECK_SMOINT samg1_set_icheck_smoint_
#define SAMG1_GET_ICHECK_SMOINT samg1_get_icheck_smoint_
#define SAMG1_SET_ICOLOR_OMP samg1_set_icolor_omp_
#define SAMG1_GET_ICOLOR_OMP samg1_get_icolor_omp_
#define SAMG1_SET_IORDERED_OMP samg1_set_iordered_omp_
#define SAMG1_GET_IORDERED_OMP samg1_get_iordered_omp_
#define SAMG1_SET_ICRITS samg1_set_icrits_
#define SAMG1_GET_ICRITS samg1_get_icrits_
#define SAMG1_SET_IDTEST_UZAWA samg1_set_idtest_uzawa_
#define SAMG1_GET_IDTEST_UZAWA samg1_get_idtest_uzawa_
#define SAMG1_SET_IHUGE samg1_set_ihuge_
#define SAMG1_GET_IHUGE samg1_get_ihuge_
#define SAMG1_SET_IJAC_UZAWA samg1_set_ijac_uzawa_
#define SAMG1_GET_IJAC_UZAWA samg1_get_ijac_uzawa_
#define SAMG1_SET_ILU4ALLSCHWARZ samg1_set_ilu4allschwarz_
#define SAMG1_GET_ILU4ALLSCHWARZ samg1_get_ilu4allschwarz_
#define SAMG1_SET_ILU_SPEED samg1_set_ilu_speed_
#define SAMG1_GET_ILU_SPEED samg1_get_ilu_speed_
#define SAMG1_SET_IMPLDO_READ_WRITE_LEN samg1_set_impldo_read_write_len_
#define SAMG1_GET_IMPLDO_READ_WRITE_LEN samg1_get_impldo_read_write_len_
#define SAMG1_SET_INFO_KEEPMEM samg1_set_info_keepmem_
#define SAMG1_GET_INFO_KEEPMEM samg1_get_info_keepmem_
#define SAMG1_SET_INNER_ACCEL samg1_set_inner_accel_
#define SAMG1_GET_INNER_ACCEL samg1_get_inner_accel_
#define SAMG1_SET_IODUMP samg1_set_iodump_
#define SAMG1_GET_IODUMP samg1_get_iodump_
#define SAMG1_ISET_IOFILE_OPTA samg1_iset_iofile_opta_
#define SAMG1_IGET_IOFILE_OPTA samg1_iget_iofile_opta_
#define SAMG1_SET_IOFILE_OPTA samg1_set_iofile_opta_
#define SAMG1_GET_IOFILE_OPTA samg1_get_iofile_opta_
#define SAMG1_ISET_IOFORM samg1_iset_ioform_
#define SAMG1_IGET_IOFORM samg1_iget_ioform_
#define SAMG1_SET_IOFORM samg1_set_ioform_
#define SAMG1_GET_IOFORM samg1_get_ioform_
#define SAMG1_SET_IOGRID samg1_set_iogrid_
#define SAMG1_GET_IOGRID samg1_get_iogrid_
#define SAMG1_SET_IOMOVIE samg1_set_iomovie_
#define SAMG1_GET_IOMOVIE samg1_get_iomovie_
#define SAMG1_SET_IOSCRATCH_DEFAULT samg1_set_ioscratch_default_
#define SAMG1_GET_IOSCRATCH_DEFAULT samg1_get_ioscratch_default_
#define SAMG1_SET_IOUNIT_OPTA samg1_set_iounit_opta_
