openCSMP/openCSMP/lib/samg/samg1.h
#define SAMG1_GET_IOUNIT_OPTA samg1_get_iounit_opta_
#define SAMG1_SET_IPASS_MAX_SET samg1_set_ipass_max_set_
#define SAMG1_GET_IPASS_MAX_SET samg1_get_ipass_max_set_
#define SAMG1_SET_IRESTRICTION_OPENMP samg1_set_irestriction_openmp_
#define SAMG1_GET_IRESTRICTION_OPENMP samg1_get_irestriction_openmp_
#define SAMG1_SET_IPRESSURE_UZAWA samg1_set_ipressure_uzawa_
#define SAMG1_GET_IPRESSURE_UZAWA samg1_get_ipressure_uzawa_
#define SAMG1_SET_IPROFILE_GEOMETRIC samg1_set_iprofile_geometric_
#define SAMG1_GET_IPROFILE_GEOMETRIC samg1_get_iprofile_geometric_
#define SAMG1_SET_ISAT_UZAWA samg1_set_isat_uzawa_
#define SAMG1_GET_ISAT_UZAWA samg1_get_isat_uzawa_
#define SAMG1_SET_ISET_VIO_DD samg1_set_iset_vio_dd_
#define SAMG1_GET_ISET_VIO_DD samg1_get_iset_vio_dd_
#define SAMG1_SET_ISSTEP_UZAWA samg1_set_isstep_uzawa_
#define SAMG1_GET_ISSTEP_UZAWA samg1_get_isstep_uzawa_
#define SAMG1_SET_ISTEP1CASE_UZAWA samg1_set_istep1case_uzawa_
#define SAMG1_GET_ISTEP1CASE_UZAWA samg1_get_istep1case_uzawa_
#define SAMG1_SET_ISTEERING samg1_set_isteering_
#define SAMG1_GET_ISTEERING samg1_get_isteering_
#define SAMG1_SET_ISWIT3_USER samg1_set_iswit3_user_
#define SAMG1_GET_ISWIT3_USER samg1_get_iswit3_user_
#define SAMG1_SET_ITER_CHECK samg1_set_iter_check_
#define SAMG1_GET_ITER_CHECK samg1_get_iter_check_
#define SAMG1_SET_ITER_MATRIX_SCALE samg1_set_iter_matrix_scale_
#define SAMG1_GET_ITER_MATRIX_SCALE samg1_get_iter_matrix_scale_
#define SAMG1_SET_ITER_PRE samg1_set_iter_pre_
#define SAMG1_GET_ITER_PRE samg1_get_iter_pre_
#define SAMG1_SET_ITMAX_CONV samg1_set_itmax_conv_
#define SAMG1_GET_ITMAX_CONV samg1_get_itmax_conv_
#define SAMG1_SET_ITRACE_AMGMAIN samg1_set_itrace_amgmain_
#define SAMG1_GET_ITRACE_AMGMAIN samg1_get_itrace_amgmain_
#define SAMG1_SET_ITRACELEVEL samg1_set_itracelevel_
#define SAMG1_GET_ITRACELEVEL samg1_get_itracelevel_
#define SAMG1_SET_ITRACE_CLSOL samg1_set_itrace_clsol_
#define SAMG1_GET_ITRACE_CLSOL samg1_get_itrace_clsol_
#define SAMG1_SET_ITRACE_CLDENSE samg1_set_itrace_cldense_
#define SAMG1_GET_ITRACE_CLDENSE samg1_get_itrace_cldense_
#define SAMG1_SET_ITRACE_DIVSTOP samg1_set_itrace_divstop_
#define SAMG1_GET_ITRACE_DIVSTOP samg1_get_itrace_divstop_
#define SAMG1_SET_ITRACE_JAC_UZAWA samg1_set_itrace_jac_uzawa_
#define SAMG1_GET_ITRACE_JAC_UZAWA samg1_get_itrace_jac_uzawa_
#define SAMG1_SET_ITRACE_MK_REGULAR samg1_set_itrace_mk_regular_
#define SAMG1_GET_ITRACE_MK_REGULAR samg1_get_itrace_mk_regular_
#define SAMG1_SET_ITRACE_MATRIX_MODE samg1_set_itrace_matrix_mode_
#define SAMG1_GET_ITRACE_MATRIX_MODE samg1_get_itrace_matrix_mode_
#define SAMG1_SET_ITRACE_MATRIX_STORAGE samg1_set_itrace_matrix_storage_
#define SAMG1_GET_ITRACE_MATRIX_STORAGE samg1_get_itrace_matrix_storage_
#define SAMG1_SET_ITRACE_SCHWARZ samg1_set_itrace_schwarz_
#define SAMG1_GET_ITRACE_SCHWARZ samg1_get_itrace_schwarz_
#define SAMG1_SET_ITRACE_SMO samg1_set_itrace_smo_
#define SAMG1_GET_ITRACE_SMO samg1_get_itrace_smo_
#define SAMG1_SET_ITRACE_SOL samg1_set_itrace_sol_
#define SAMG1_GET_ITRACE_SOL samg1_get_itrace_sol_
#define SAMG1_SET_ITRACE_SPLIT samg1_set_itrace_split_
#define SAMG1_GET_ITRACE_SPLIT samg1_get_itrace_split_
#define SAMG1_SET_ITRACE_UZAWA samg1_set_itrace_uzawa_
#define SAMG1_GET_ITRACE_UZAWA samg1_get_itrace_uzawa_
#define SAMG1_SET_SMOAGG_NOQR samg1_set_smoagg_noqr_
#define SAMG1_GET_SMOAGG_NOQR samg1_get_smoagg_noqr_
#define SAMG1_SET_STACKTRACE samg1_set_stacktrace_
#define SAMG1_GET_STACKTRACE samg1_get_stacktrace_
#define SAMG1_SET_STORE_PGS_FACTOR samg1_set_store_pgs_factor_
#define SAMG1_GET_STORE_PGS_FACTOR samg1_get_store_pgs_factor_
#define SAMG1_SET_KCYCLE_PROFILE samg1_set_kcycle_profile_
#define SAMG1_GET_KCYCLE_PROFILE samg1_get_kcycle_profile_
#define SAMG1_SET_KEEPMEM samg1_set_keepmem_
#define SAMG1_GET_KEEPMEM samg1_get_keepmem_
#define SAMG1_SET_K_DISABLE_KRYLOV1 samg1_set_k_disable_krylov1_
#define SAMG1_GET_K_DISABLE_KRYLOV1 samg1_get_k_disable_krylov1_
#define SAMG1_SET_K_DYNCYC samg1_set_k_dyncyc_
#define SAMG1_GET_K_DYNCYC samg1_get_k_dyncyc_
#define SAMG1_SET_LASTGRID samg1_set_lastgrid_
#define SAMG1_GET_LASTGRID samg1_get_lastgrid_
#define SAMG1_SET_LEV_COARSENING_TOO_SLOW samg1_set_lev_coarsening_too_slow_
#define SAMG1_GET_LEV_COARSENING_TOO_SLOW samg1_get_lev_coarsening_too_slow_
#define SAMG1_SET_LEVELS_UZAWA samg1_set_levels_uzawa_
#define SAMG1_GET_LEVELS_UZAWA samg1_get_levels_uzawa_
#define SAMG1_SET_LEVELX samg1_set_levelx_
#define SAMG1_GET_LEVELX samg1_get_levelx_
#define SAMG1_SET_LEVELX_2ND samg1_set_levelx_2nd_
#define SAMG1_GET_LEVELX_2ND samg1_get_levelx_2nd_
#define SAMG1_SET_LFIL_CL samg1_set_lfil_cl_
#define SAMG1_GET_LFIL_CL samg1_get_lfil_cl_
#define SAMG1_SET_LFIL_2ND samg1_set_lfil_2nd_
#define SAMG1_GET_LFIL_2ND samg1_get_lfil_2nd_
#define SAMG1_SET_LFIL_SMO samg1_set_lfil_smo_
#define SAMG1_GET_LFIL_SMO samg1_get_lfil_smo_
#define SAMG1_ISET_LOGFILE samg1_iset_logfile_
#define SAMG1_IGET_LOGFILE samg1_iget_logfile_
#define SAMG1_SET_LOGFILE samg1_set_logfile_
#define SAMG1_GET_LOGFILE samg1_get_logfile_
#define SAMG1_SET_LOGIO samg1_set_logio_
#define SAMG1_GET_LOGIO samg1_get_logio_
#define SAMG1_SET_LU_REUSE samg1_set_lu_reuse_
#define SAMG1_GET_LU_REUSE samg1_get_lu_reuse_
#define SAMG1_SET_MATRIX_MODE samg1_set_matrix_mode_
#define SAMG1_GET_MATRIX_MODE samg1_get_matrix_mode_
#define SAMG1_SET_MATRIX_FORMAT samg1_set_matrix_format_
#define SAMG1_GET_MATRIX_FORMAT samg1_get_matrix_format_
#define SAMG1_SET_MATRIX_SCALE_RENORM samg1_set_matrix_scale_renorm_
#define SAMG1_GET_MATRIX_SCALE_RENORM samg1_get_matrix_scale_renorm_
#define SAMG1_SET_MAX_CALLS samg1_set_max_calls_
#define SAMG1_GET_MAX_CALLS samg1_get_max_calls_
#define SAMG1_SET_MAX_CL_SIZE samg1_set_max_cl_size_
#define SAMG1_GET_MAX_CL_SIZE samg1_get_max_cl_size_
#define SAMG1_SET_MAXCORR_CLUSTER samg1_set_maxcorr_cluster_
#define SAMG1_GET_MAXCORR_CLUSTER samg1_get_maxcorr_cluster_
#define SAMG1_SET_MAX_LEVEL samg1_set_max_level_
#define SAMG1_GET_MAX_LEVEL samg1_get_max_level_
#define SAMG1_SET_MAX_NB_LIST_SIZE samg1_set_max_nb_list_size_
#define SAMG1_GET_MAX_NB_LIST_SIZE samg1_get_max_nb_list_size_
#define SAMG1_SET_MAXITER_JAC_UZAWA samg1_set_maxiter_jac_uzawa_
#define SAMG1_GET_MAXITER_JAC_UZAWA samg1_get_maxiter_jac_uzawa_
#define SAMG1_SET_MAXOP_RESTART samg1_set_maxop_restart_
#define SAMG1_GET_MAXOP_RESTART samg1_get_maxop_restart_
#define SAMG1_SET_MAXRETRY_JAC_UZAWA samg1_set_maxretry_jac_uzawa_
#define SAMG1_GET_MAXRETRY_JAC_UZAWA samg1_get_maxretry_jac_uzawa_
#define SAMG1_SET_MILU samg1_set_milu_
#define SAMG1_GET_MILU samg1_get_milu_
#define SAMG1_SET_MIN_CL_SIZE samg1_set_min_cl_size_
#define SAMG1_GET_MIN_CL_SIZE samg1_get_min_cl_size_
#define SAMG1_SET_MIN_MULTI_SIZE samg1_set_min_multi_size_
#define SAMG1_GET_MIN_MULTI_SIZE samg1_get_min_multi_size_
#define SAMG1_SET_MINITER_JAC_UZAWA samg1_set_miniter_jac_uzawa_
#define SAMG1_GET_MINITER_JAC_UZAWA samg1_get_miniter_jac_uzawa_
#define SAMG1_SET_MK_REGULAR samg1_set_mk_regular_
#define SAMG1_GET_MK_REGULAR samg1_get_mk_regular_
#define SAMG1_SET_MODE_CNTRL samg1_set_mode_cntrl_
#define SAMG1_GET_MODE_CNTRL samg1_get_mode_cntrl_
#define SAMG1_SET_MODE_DEBUG samg1_set_mode_debug_
#define SAMG1_GET_MODE_DEBUG samg1_get_mode_debug_
#define SAMG1_SET_MODE_MESS samg1_set_mode_mess_
#define SAMG1_GET_MODE_MESS samg1_get_mode_mess_
#define SAMG1_SET_MODIFY_MAT samg1_set_modify_mat_
#define SAMG1_GET_MODIFY_MAT samg1_get_modify_mat_
#define SAMG1_SET_MODIFY_RESTRICTION samg1_set_modify_restriction_
#define SAMG1_GET_MODIFY_RESTRICTION samg1_get_modify_restriction_
#define SAMG1_SET_MULTIPASS_ALLCOUP samg1_set_multipass_allcoup_
#define SAMG1_GET_MULTIPASS_ALLCOUP samg1_get_multipass_allcoup_
#define SAMG1_SET_NBLK_DEBUG samg1_set_nblk_debug_
#define SAMG1_GET_NBLK_DEBUG samg1_get_nblk_debug_
#define SAMG1_SET_NBLK_MAX samg1_set_nblk_max_
#define SAMG1_GET_NBLK_MAX samg1_get_nblk_max_
#define SAMG1_SET_NBLK_OVERLAP samg1_set_nblk_overlap_
#define SAMG1_GET_NBLK_OVERLAP samg1_get_nblk_overlap_
#define SAMG1_SET_NBLK_RESID samg1_set_nblk_resid_
#define SAMG1_GET_NBLK_RESID samg1_get_nblk_resid_
#define SAMG1_SET_NBLK_SOLVE samg1_set_nblk_solve_
#define SAMG1_GET_NBLK_SOLVE samg1_get_nblk_solve_
#define SAMG1_SET_NBLK_SOLVER samg1_set_nblk_solver_
#define SAMG1_GET_NBLK_SOLVER samg1_get_nblk_solver_
#define SAMG1_SET_NBND_OMEGA samg1_set_nbnd_omega_
#define SAMG1_GET_NBND_OMEGA samg1_get_nbnd_omega_
#define SAMG1_SET_NBND_OMEGA_UZAWA samg1_set_nbnd_omega_uzawa_
#define SAMG1_GET_NBND_OMEGA_UZAWA samg1_get_nbnd_omega_uzawa_
#define SAMG1_SET_NBND_SWEEPS samg1_set_nbnd_sweeps_
#define SAMG1_GET_NBND_SWEEPS samg1_get_nbnd_sweeps_
#define SAMG1_SET_NBND_SWEEPS_UZAWA samg1_set_nbnd_sweeps_uzawa_
#define SAMG1_GET_NBND_SWEEPS_UZAWA samg1_get_nbnd_sweeps_uzawa_
#define SAMG1_SET_NCOLOR_BLOCK_GS samg1_set_ncolor_block_gs_
#define SAMG1_GET_NCOLOR_BLOCK_GS samg1_get_ncolor_block_gs_
#define SAMG1_SET_NCOLOR_BLOCK_GS_MSG samg1_set_ncolor_block_gs_msg_
#define SAMG1_GET_NCOLOR_BLOCK_GS_MSG samg1_get_ncolor_block_gs_msg_
#define SAMG1_SET_NCOLOR_BLOCK_GS_RESCHK samg1_set_ncolor_block_gs_reschk_
#define SAMG1_GET_NCOLOR_BLOCK_GS_RESCHK samg1_get_ncolor_block_gs_reschk_
#define SAMG1_SET_NDEGREE_CHEBY samg1_set_ndegree_cheby_
#define SAMG1_GET_NDEGREE_CHEBY samg1_get_ndegree_cheby_
#define SAMG1_SET_NCFRAMES samg1_set_ncframes_
#define SAMG1_GET_NCFRAMES samg1_get_ncframes_
#define SAMG1_SET_NCG samg1_set_ncg_
#define SAMG1_GET_NCG samg1_get_ncg_
#define SAMG1_SET_NCGRAD_DEFAULT samg1_set_ncgrad_default_
#define SAMG1_GET_NCGRAD_DEFAULT samg1_get_ncgrad_default_
#define SAMG1_SET_NCYC_DEFAULT samg1_set_ncyc_default_
#define SAMG1_GET_NCYC_DEFAULT samg1_get_ncyc_default_
#define SAMG1_SET_NCYC_MIN samg1_set_ncyc_min_
#define SAMG1_GET_NCYC_MIN samg1_get_ncyc_min_
#define SAMG1_SET_NCYC_2ND samg1_set_ncyc_2nd_
#define SAMG1_GET_NCYC_2ND samg1_get_ncyc_2nd_
#define SAMG1_SET_NCYC_START samg1_set_ncyc_start_
#define SAMG1_GET_NCYC_START samg1_get_ncyc_start_
#define SAMG1_SET_NDYN_SMO samg1_set_ndyn_smo_
#define SAMG1_GET_NDYN_SMO samg1_get_ndyn_smo_
#define SAMG1_SET_NEG_DIAG samg1_set_neg_diag_
#define SAMG1_GET_NEG_DIAG samg1_get_neg_diag_
#define SAMG1_SET_NEG_DIAG_BRUTE samg1_set_neg_diag_brute_
#define SAMG1_GET_NEG_DIAG_BRUTE samg1_get_neg_diag_brute_
#define SAMG1_SET_NEW_ENTRIES samg1_set_new_entries_
#define SAMG1_GET_NEW_ENTRIES samg1_get_new_entries_
#define SAMG1_SET_NEW_TOPOLOGY samg1_set_new_topology_
#define SAMG1_GET_NEW_TOPOLOGY samg1_get_new_topology_
#define SAMG1_SET_NILU_REORDER samg1_set_nilu_reorder_
#define SAMG1_GET_NILU_REORDER samg1_get_nilu_reorder_
#define SAMG1_SET_NINCR_RES_ACCEPTED_MG samg1_set_nincr_res_accepted_mg_
#define SAMG1_GET_NINCR_RES_ACCEPTED_MG samg1_get_nincr_res_accepted_mg_
#define SAMG1_SET_NINCR_RES_ACCEPTED_1G samg1_set_nincr_res_accepted_1g_
#define SAMG1_GET_NINCR_RES_ACCEPTED_1G samg1_get_nincr_res_accepted_1g_
#define SAMG1_SET_NINT_ROWSUM1 samg1_set_nint_rowsum1_
#define SAMG1_GET_NINT_ROWSUM1 samg1_get_nint_rowsum1_
#define SAMG1_SET_NINTER_OMP samg1_set_ninter_omp_
#define SAMG1_GET_NINTER_OMP samg1_get_ninter_omp_
#define SAMG1_SET_NITER_SKIP samg1_set_niter_skip_
#define SAMG1_GET_NITER_SKIP samg1_get_niter_skip_
#define SAMG1_SET_NKCYCLE samg1_set_nkcycle_
#define SAMG1_GET_NKCYCLE samg1_get_nkcycle_
#define SAMG1_SET_NKDIM_DEFAULT samg1_set_nkdim_default_
#define SAMG1_GET_NKDIM_DEFAULT samg1_get_nkdim_default_
#define SAMG1_SET_NSMOOTH_COO_POLY samg1_set_nsmooth_coo_poly_
#define SAMG1_GET_NSMOOTH_COO_POLY samg1_get_nsmooth_coo_poly_
#define SAMG1_SET_NSMOAGG samg1_set_nsmoagg_
#define SAMG1_GET_NSMOAGG samg1_get_nsmoagg_
#define SAMG1_SET_NSMOAGG1LEV samg1_set_nsmoagg1lev_
#define SAMG1_GET_NSMOAGG1LEV samg1_get_nsmoagg1lev_
#define SAMG1_SET_NSMOAGGLEV samg1_set_nsmoagglev_
#define SAMG1_GET_NSMOAGGLEV samg1_get_nsmoagglev_
#define SAMG1_SET_NMIN_MATRIX samg1_set_nmin_matrix_
#define SAMG1_GET_NMIN_MATRIX samg1_get_nmin_matrix_
#define SAMG1_SET_NMIN_MATRIX_RESC samg1_set_nmin_matrix_resc_
#define SAMG1_GET_NMIN_MATRIX_RESC samg1_get_nmin_matrix_resc_
#define SAMG1_SET_NMIN_VECTOR samg1_set_nmin_vector_
#define SAMG1_GET_NMIN_VECTOR samg1_get_nmin_vector_
#define SAMG1_SET_NOTALLUNS_CHEAP samg1_set_notalluns_cheap_
#define SAMG1_GET_NOTALLUNS_CHEAP samg1_get_notalluns_cheap_
#define SAMG1_SET_NP_MOD1 samg1_set_np_mod1_
#define SAMG1_GET_NP_MOD1 samg1_get_np_mod1_
#define SAMG1_SET_NP_MOD2 samg1_set_np_mod2_
#define SAMG1_GET_NP_MOD2 samg1_get_np_mod2_
#define SAMG1_SET_NP_OPT samg1_set_np_opt_
#define SAMG1_GET_NP_OPT samg1_get_np_opt_
#define SAMG1_SET_NPRIM_AT_ALLPNTS samg1_set_nprim_at_allpnts_
#define SAMG1_GET_NPRIM_AT_ALLPNTS samg1_get_nprim_at_allpnts_
#define SAMG1_SET_NPTMAX samg1_set_nptmax_
#define SAMG1_GET_NPTMAX samg1_get_nptmax_
#define SAMG1_SET_NPTMN samg1_set_nptmn_
#define SAMG1_GET_NPTMN samg1_get_nptmn_
#define SAMG1_SET_NRC samg1_set_nrc_
#define SAMG1_GET_NRC samg1_get_nrc_
#define SAMG1_SET_NRC_EMERGENCY samg1_set_nrc_emergency_
#define SAMG1_GET_NRC_EMERGENCY samg1_get_nrc_emergency_
#define SAMG1_SET_NRD samg1_set_nrd_
#define SAMG1_GET_NRD samg1_get_nrd_
#define SAMG1_SET_NRD_2ND samg1_set_nrd_2nd_
#define SAMG1_GET_NRD_2ND samg1_get_nrd_2nd_
#define SAMG1_SET_NRU samg1_set_nru_
#define SAMG1_GET_NRU samg1_get_nru_
#define SAMG1_SET_NRU_2ND samg1_set_nru_2nd_
#define SAMG1_GET_NRU_2ND samg1_get_nru_2nd_
#define SAMG1_SET_NSIMPLE_EMERGENCY samg1_set_nsimple_emergency_
#define SAMG1_GET_NSIMPLE_EMERGENCY samg1_get_nsimple_emergency_
#define SAMG1_SET_NSOLVE_DEFAULT samg1_set_nsolve_default_
#define SAMG1_GET_NSOLVE_DEFAULT samg1_get_nsolve_default_
#define SAMG1_SET_NSOLVE_2ND samg1_set_nsolve_2nd_
#define SAMG1_GET_NSOLVE_2ND samg1_get_nsolve_2nd_
#define SAMG1_SET_NSOLVE_UZAWA samg1_set_nsolve_uzawa_
#define SAMG1_GET_NSOLVE_UZAWA samg1_get_nsolve_uzawa_
#define SAMG1_SET_NSTAR_TYP samg1_set_nstar_typ_
#define SAMG1_GET_NSTAR_TYP samg1_get_nstar_typ_
#define SAMG1_SET_NSW_OMEGA_UZAWA samg1_set_nsw_omega_uzawa_
#define SAMG1_GET_NSW_OMEGA_UZAWA samg1_get_nsw_omega_uzawa_
#define SAMG1_SET_NSW_UZAWA samg1_set_nsw_uzawa_
#define SAMG1_GET_NSW_UZAWA samg1_get_nsw_uzawa_
#define SAMG1_SET_NTAKE_RES_IN samg1_set_ntake_res_in_
#define SAMG1_GET_NTAKE_RES_IN samg1_get_ntake_res_in_
#define SAMG1_SET_NTH_RES_SCRATCH samg1_set_nth_res_scratch_
#define SAMG1_GET_NTH_RES_SCRATCH samg1_get_nth_res_scratch_
#define SAMG1_SET_NTR samg1_set_ntr_
#define SAMG1_GET_NTR samg1_get_ntr_
#define SAMG1_SET_NTR_PRIM samg1_set_ntr_prim_
#define SAMG1_GET_NTR_PRIM samg1_get_ntr_prim_
#define SAMG1_SET_NTYP_ACCEL samg1_set_ntyp_accel_
#define SAMG1_GET_NTYP_ACCEL samg1_get_ntyp_accel_
#define SAMG1_SET_NTYP_GALERKIN samg1_set_ntyp_galerkin_
#define SAMG1_GET_NTYP_GALERKIN samg1_get_ntyp_galerkin_
#define SAMG1_SET_NUMTRY_MAX_SET samg1_set_numtry_max_set_
#define SAMG1_GET_NUMTRY_MAX_SET samg1_get_numtry_max_set_
#define SAMG1_SET_NVERSION samg1_set_nversion_
#define SAMG1_GET_NVERSION samg1_get_nversion_
#define SAMG1_SET_NWT samg1_set_nwt_
#define SAMG1_GET_NWT samg1_get_nwt_
#define SAMG1_SET_NXTYP_COARSE samg1_set_nxtyp_coarse_
#define SAMG1_GET_NXTYP_COARSE samg1_get_nxtyp_coarse_
#define SAMG1_SET_OIL_ACCEL samg1_set_oil_accel_
#define SAMG1_GET_OIL_ACCEL samg1_get_oil_accel_
#define SAMG1_SET_OIL_GPRS samg1_set_oil_gprs_
#define SAMG1_GET_OIL_GPRS samg1_get_oil_gprs_
#define SAMG1_SET_OIL_NOPRIM samg1_set_oil_noprim_
#define SAMG1_GET_OIL_NOPRIM samg1_get_oil_noprim_
#define SAMG1_SET_OMEGA_JAC_ES_UZAWA samg1_set_omega_jac_es_uzawa_
#define SAMG1_GET_OMEGA_JAC_ES_UZAWA samg1_get_omega_jac_es_uzawa_
#define SAMG1_SET_OMEGA_JAC_P_UZAWA samg1_set_omega_jac_p_uzawa_
#define SAMG1_GET_OMEGA_JAC_P_UZAWA samg1_get_omega_jac_p_uzawa_
#define SAMG1_SET_OMEGA_JACOBI samg1_set_omega_jacobi_
#define SAMG1_GET_OMEGA_JACOBI samg1_get_omega_jacobi_
#define SAMG1_SET_OMEGA_SOR_DO samg1_set_omega_sor_do_
#define SAMG1_GET_OMEGA_SOR_DO samg1_get_omega_sor_do_
#define SAMG1_SET_OMEGA_SOR_UP samg1_set_omega_sor_up_
#define SAMG1_GET_OMEGA_SOR_UP samg1_get_omega_sor_up_
#define SAMG1_SET_OMEGA_SMO samg1_set_omega_smo_
#define SAMG1_GET_OMEGA_SMO samg1_get_omega_smo_
#define SAMG1_SET_OMEGA_SMO_MIN samg1_set_omega_smo_min_
#define SAMG1_GET_OMEGA_SMO_MIN samg1_get_omega_smo_min_
#define SAMG1_SET_OMEGA_UZAWA samg1_set_omega_uzawa_
#define SAMG1_GET_OMEGA_UZAWA samg1_get_omega_uzawa_
#define SAMG1_SET_OMP_ILU samg1_set_omp_ilu_
#define SAMG1_GET_OMP_ILU samg1_get_omp_ilu_
#define SAMG1_ISET_OMP_PARTITION_FILE samg1_iset_omp_partition_file_
#define SAMG1_IGET_OMP_PARTITION_FILE samg1_iget_omp_partition_file_
#define SAMG1_SET_OMP_PARTITION_FILE samg1_set_omp_partition_file_
#define SAMG1_GET_OMP_PARTITION_FILE samg1_get_omp_partition_file_
#define SAMG1_SET_OMP_NUM_THREADS_EXTERNAL samg1_set_omp_num_threads_external_
#define SAMG1_GET_OMP_NUM_THREADS_EXTERNAL samg1_get_omp_num_threads_external_
#define SAMG1_SET_OMP_NTHREADS_ONLY4SPLIT samg1_set_omp_nthreads_only4split_
#define SAMG1_GET_OMP_NTHREADS_ONLY4SPLIT samg1_get_omp_nthreads_only4split_
#define SAMG1_SET_OMP_UZAWA samg1_set_omp_uzawa_
#define SAMG1_GET_OMP_UZAWA samg1_get_omp_uzawa_
#define SAMG1_SET_OPT_MATRIX_OPS samg1_set_opt_matrix_ops_
#define SAMG1_GET_OPT_MATRIX_OPS samg1_get_opt_matrix_ops_
#define SAMG1_SET_P_CMPLX_AGG_DEFAULT samg1_set_p_cmplx_agg_default_
#define SAMG1_GET_P_CMPLX_AGG_DEFAULT samg1_get_p_cmplx_agg_default_
#define SAMG1_SET_P_CMPLX_DEFAULT samg1_set_p_cmplx_default_
#define SAMG1_GET_P_CMPLX_DEFAULT samg1_get_p_cmplx_default_
#define SAMG1_SET_PARTIAL_FRAC samg1_set_partial_frac_
#define SAMG1_GET_PARTIAL_FRAC samg1_get_partial_frac_
#define SAMG1_ISET_PARTITION_FILE samg1_iset_partition_file_
#define SAMG1_IGET_PARTITION_FILE samg1_iget_partition_file_
#define SAMG1_SET_PARTITION_FILE samg1_set_partition_file_
#define SAMG1_GET_PARTITION_FILE samg1_get_partition_file_
#define SAMG1_SET_AMG_RENUMBER samg1_set_amg_renumber_
#define SAMG1_GET_AMG_RENUMBER samg1_get_amg_renumber_
#define SAMG1_ISET_AMG_RENUMBER_FILE samg1_iset_amg_renumber_file_
#define SAMG1_IGET_AMG_RENUMBER_FILE samg1_iget_amg_renumber_file_
#define SAMG1_SET_AMG_RENUMBER_FILE samg1_set_amg_renumber_file_
#define SAMG1_GET_AMG_RENUMBER_FILE samg1_get_amg_renumber_file_
#define SAMG1_ISET_DUMPFILE_RENUMBER samg1_iset_dumpfile_renumber_
#define SAMG1_IGET_DUMPFILE_RENUMBER samg1_iget_dumpfile_renumber_
#define SAMG1_SET_DUMPFILE_RENUMBER samg1_set_dumpfile_renumber_
#define SAMG1_GET_DUMPFILE_RENUMBER samg1_get_dumpfile_renumber_
#define SAMG1_SET_PERF_METER_ENABLED samg1_set_perf_meter_enabled_
#define SAMG1_GET_PERF_METER_ENABLED samg1_get_perf_meter_enabled_
#define SAMG1_SET_PRIM_NORM samg1_set_prim_norm_
#define SAMG1_GET_PRIM_NORM samg1_get_prim_norm_
#define SAMG1_SET_PRIM_PRINT samg1_set_prim_print_
#define SAMG1_GET_PRIM_PRINT samg1_get_prim_print_
#define SAMG1_SET_PRINT_NXTYP_COARSE_MSG samg1_set_print_nxtyp_coarse_msg_
#define SAMG1_GET_PRINT_NXTYP_COARSE_MSG samg1_get_print_nxtyp_coarse_msg_
#define SAMG1_SET_PRINT_SETUP_ILU_OR_DIRECT samg1_set_print_setup_ilu_or_direct_
#define SAMG1_GET_PRINT_SETUP_ILU_OR_DIRECT samg1_get_print_setup_ilu_or_direct_
#define SAMG1_SET_PRNT_STAT_SCHWARZ samg1_set_prnt_stat_schwarz_
#define SAMG1_GET_PRNT_STAT_SCHWARZ samg1_get_prnt_stat_schwarz_
#define SAMG1_SET_QUASI_ONLY samg1_set_quasi_only_
#define SAMG1_GET_QUASI_ONLY samg1_get_quasi_only_
#define SAMG1_SET_REDUCT_KCYCLE samg1_set_reduct_kcycle_
#define SAMG1_GET_REDUCT_KCYCLE samg1_get_reduct_kcycle_
#define SAMG1_SET_RBM_INTERN_INFO samg1_set_rbm_intern_info_
#define SAMG1_GET_RBM_INTERN_INFO samg1_get_rbm_intern_info_
#define SAMG1_SET_RCONDX samg1_set_rcondx_
#define SAMG1_GET_RCONDX samg1_get_rcondx_
#define SAMG1_SET_READ_UZAWA_PARMS samg1_set_read_uzawa_parms_
#define SAMG1_GET_READ_UZAWA_PARMS samg1_get_read_uzawa_parms_
#define SAMG1_SET_READ_MARIAN_COARSENING samg1_set_read_marian_coarsening_
#define SAMG1_GET_READ_MARIAN_COARSENING samg1_get_read_marian_coarsening_
#define SAMG1_SET_REFRESH_CALLED samg1_set_refresh_called_
#define SAMG1_GET_REFRESH_CALLED samg1_get_refresh_called_
#define SAMG1_SET_REL_APP_VAR samg1_set_rel_app_var_
#define SAMG1_GET_REL_APP_VAR samg1_get_rel_app_var_
#define SAMG1_SET_RHO_MIN samg1_set_rho_min_
#define SAMG1_GET_RHO_MIN samg1_get_rho_min_
#define SAMG1_SET_RHO_OK samg1_set_rho_ok_
#define SAMG1_GET_RHO_OK samg1_get_rho_ok_
#define SAMG1_SET_SHOW_UN_RES samg1_set_show_un_res_
#define SAMG1_GET_SHOW_UN_RES samg1_get_show_un_res_
#define SAMG1_ISET_SCRATCHFILE samg1_iset_scratchfile_
#define SAMG1_IGET_SCRATCHFILE samg1_iget_scratchfile_
#define SAMG1_SET_SCRATCHFILE samg1_set_scratchfile_
#define SAMG1_GET_SCRATCHFILE samg1_get_scratchfile_
#define SAMG1_SET_SLOW_COARSENING samg1_set_slow_coarsening_
#define SAMG1_GET_SLOW_COARSENING samg1_get_slow_coarsening_
#define SAMG1_SET_STABILITY samg1_set_stability_
#define SAMG1_GET_STABILITY samg1_get_stability_
#define SAMG1_SET_STRUCT_IDENT samg1_set_struct_ident_
#define SAMG1_GET_STRUCT_IDENT samg1_get_struct_ident_
#define SAMG1_SET_STRUCT_SYMM samg1_set_struct_symm_
#define SAMG1_GET_STRUCT_SYMM samg1_get_struct_symm_
#define SAMG1_SET_TAU_UZAWA samg1_set_tau_uzawa_
#define SAMG1_GET_TAU_UZAWA samg1_get_tau_uzawa_
#define SAMG1_SET_TERM_COARSENING samg1_set_term_coarsening_
#define SAMG1_GET_TERM_COARSENING samg1_get_term_coarsening_
#define SAMG1_SET_TRACE_L2_QUASI_RES samg1_set_trace_l2_quasi_res_
#define SAMG1_GET_TRACE_L2_QUASI_RES samg1_get_trace_l2_quasi_res_
#define SAMG1_SET_TRACKMEM samg1_set_trackmem_
#define SAMG1_GET_TRACKMEM samg1_get_trackmem_
#define SAMG1_SET_TRACKRESID samg1_set_trackresid_
#define SAMG1_GET_TRACKRESID samg1_get_trackresid_
#define SAMG1_SET_TRACK_AP_P samg1_set_track_ap_p_
#define SAMG1_GET_TRACK_AP_P samg1_get_track_ap_p_
#define SAMG1_SET_USE_IC samg1_set_use_ic_
#define SAMG1_GET_USE_IC samg1_get_use_ic_
#define SAMG1_SET_VIO_DD samg1_set_vio_dd_
#define SAMG1_GET_VIO_DD samg1_get_vio_dd_
#define SAMG1_SET_W_AVRGE_AGG_DEFAULT samg1_set_w_avrge_agg_default_
#define SAMG1_GET_W_AVRGE_AGG_DEFAULT samg1_get_w_avrge_agg_default_
#define SAMG1_SET_W_AVRGE_DEFAULT samg1_set_w_avrge_default_
#define SAMG1_GET_W_AVRGE_DEFAULT samg1_get_w_avrge_default_
#define SAMG1_SET_WCOUPLED samg1_set_wcoupled_
#define SAMG1_GET_WCOUPLED samg1_get_wcoupled_
#define SAMG1_SET_WFT samg1_set_wft_
#define SAMG1_GET_WFT samg1_get_wft_
#define SAMG1_SET_WLEN_SWITCHES_GALERKIN samg1_set_wlen_switches_galerkin_
#define SAMG1_GET_WLEN_SWITCHES_GALERKIN samg1_get_wlen_switches_galerkin_
#define SAMG1_SET_WRITE_CLUSTER_ID samg1_set_write_cluster_id_
#define SAMG1_GET_WRITE_CLUSTER_ID samg1_get_write_cluster_id_
#define SAMG1_SET_WTSL samg1_set_wtsl_
#define SAMG1_GET_WTSL samg1_get_wtsl_
#define SAMG1_RELEASE_INFO samg1_release_info_
#define SAMG1_VERSION_INFO samg1_version_info_
#define SAMG1_DETAILS_INFO samg1_details_info_
#endif

